Repository: prusa3d/Prusa-Firmware-Buddy
Catalog: src/lang/po/*/Prusa-Firmware-Buddy_*.po
Languages: it

source: Heatbed tile no. %d: Damaged tile or wiring. Follow online guide to diagnose.
it: Piastrella del piano riscaldato no. %d: Piastrella o cablaggio danneggiati. Segui la guida online per la diagnosi.

source: Heatbreak Fan
it: Ventola Heatbreak

source: Heating disabled due to 10 minutes of inactivity.
it: Riscaldamento disattivato dopo 10 minuti di inattività.

source: All filament sensors enabled.
it: Tutti i sensori del filamento sono abilitati.

source: All nozzles
it: Tutti gli ugelli

source: An error occurred during the belt tuning procedure. Try running the calibration again.
it: Si è verificato un errore durante la procedura di regolazione della cinghia. Prova a eseguire nuovamente la calibrazione.

source: Are you sure to stop this printing?
it: Vuoi interrompere la stampa?

source: Attention: Ensure the accelerometer is properly connected. Follow the step-by-step guide in the link below:
it: Attenzione: Assicurati che l'accelerometro sia collegato correttamente. Segui la guida passo-passo nel link sottostante:

source: %d Phase Stepping Calibration
it: Calibrazione Phase Stepping %d

source: Bed Temp
it: Temp. Piano

source: Before you continue, make sure the print sheet is installed on the heatbed.
it: Prima di continuare, assicurati che la piastra di stampa sia sul piano riscaldato.

source: COOLDOWN
it: RAFFREDDA

source: Calibrating accelerometer
it: Calibrazione accelerometro

source: Cancel Object
it: Cancella Oggetto

source: Change to
it: Cambia a

source: Changing filament
it: Cambio filamento

source: Changing tool
it: Cambio strumento

source: Chamber Dimming
it: Dimmerazione della camera

source: Computed shapers: X axis %3s %3dHz Y axis %3s %3dHz Store and use computed values?
it: Shaper elaborati: Asse X %3s %3dHz Asse Y %3s %3dHz Memorizzare e utilizzare i valori calcolati?

source: Confirm
it: Conferma

source: Crash Detection Filter
it: Filtro per il rilevamento delle collisioni

source: Crash Sensitivity XY
it: Sensibilità collisione XY

source: Bed Level Correction
it: Correzione Livello Piano

source: Crash detected. Save it to USB? Do not share the file publicly, the crash dump may include unencrypted sensitive information. Send it to: reports@prusa3d.com
it: Crash rilevato. Salvarlo su USB? Non condividere il file pubblicamente, il crash dump potrebbe contenere informazioni sensibili non crittografate. Invialo a: reports@prusa3d.com

source: Crashes on X Axis
it: Collisioni su asse X

source: Crashes on Y Axis
it: Collisioni su asse Y

source: Current tool
it: Strumento attuale

source: DISABLE
it: DISABILITA

source: Device Hash in QR
it: Info stampante in QR

source: Disabled
it: Disabilitato

source: Do not touch the printer! The printer is moving while measuring dock position.
it: Non toccare la stampante! La stampante si muove durante la misurazione della posizione del dock.

source: Do not touch the printer! The printer is performing the parking test. Be careful around the moving parts.
it: Non toccare la stampante! La stampante sta eseguendo il test di parcheggio. Fai attenzione alle parti in movimento.

source: Do not touch the printer. Be careful around the moving parts.
it: Non toccare la stampante. Fai attenzione alle parti in movimento.

source: Don't change
it: Non cambiare

source: EXPIRED
it: SCADUTO

source: Enclosure temperature
it: Temperatura involucro

source: Exit
it: Esci

source: Extruder
it: Estrusore

source: Extruder Maintenance
it: Manutenzione Estrusore

source: FILAMENT MMU
it: FILAMENTO MMU

source: FS Value
it: Valore FS

source: FW UPDATE
it: AGGIORNAMENTO FW

source: FW updated
it: FW aggiornato

source: Failed to load config. Make sure the ini file downloaded from Connect is on the USB drive and try again.
it: Impossibile caricare la configurazione. Assicurati che il file ini scaricato da Connect sia sulla chiavetta USB e riprova.

source: Failed to open file '%s' for writing.
it: Impossibile aprire il file '%s' per la scrittura.

source: Feeding to fsensor
it: Alim. in FSensor

source: Feeding to nozzle
it: Alim. in ugello

source: Fan Check
it: Controllo Ventola

source: Feeding to FINDA
it: Alim. in FINDA

source: Feeding to drive gear
it: Alim. in ingranaggio

source: Generate Password
it: Genera password

source: Filament Autoloading
it: Caricamento filamento automatico

source: Filament Sensor
it: Sensore filamento

source: Filament appears to be already loaded, are you sure you want to load it anyway?
it: Il filamento sembra essere già caricato, sei sicuro di volerlo caricare comunque?

source: File removed or transfer aborted
it: File rimosso o trasferimento interrotto

source: Finishing moves
it: Finaliz. spostamenti

source: Firmware Version
it: Versione firmware

source: Hard Reset (USB with FW needed)
it: Hard reset (necessaria USB con il FW)

source: G-code command was too long and did not fit in the internal buffers. As a result, it may have been executed incorrectly.
it: Il comando G-code era troppo lungo e non rientrava nei buffer interni. Di conseguenza, potrebbe essere stato eseguito in modo errato.

source: HW test begin
it: HW test inizio

source: HW test exec
it: HW test esec

source: HW test pulley
it: HW test puleggia

source: HW test selector
it: Test HW selettore

source: Hi, this is your Original Prusa MK3.5 printer. I would like to guide you through the setup process.
it: Ciao, sono la tua stampante Original Prusa MK3.5. Ti guiderò nel processo di configurazione.

source: Hostname is not valid. Following conditions must apply: - Not empty - Contains only characters 'a-z A-Z 0-9 -' - Not starting with '-'
it: Il nome dell'host non è valido. Devono essere soddisfatte le seguenti condizioni: - Non è vuoto - Contiene solo i caratteri "a-z A-Z 0-9 -". - Non inizia con "-".

source: Hotend fan
it: Ventola hotend

source: IGNORE
it: IGNORA

source: Install belt dampeners
it: Monta gli smorzatori cinghia

source: Is color correct?
it: Il colore è corretto?

source: Is filament in extruder gear?
it: Il filamento è nell'ingranaggio dell'estrusore?

source: LOAD
it: CARICA

source: Last Print Crashes on X Axis
it: Collisioni su asse X ultima stampa

source: Load Settings
it: Carica impostazioni

source: Load Settings from File
it: Carica impostazioni da file

source: Loadcell test failed.
it: Test Cella di carico non riuscito.

source: Loadcell test passed OK.
it: Test Cella di carico OK.

source: Loaded successfully. Connect will activate shortly.
it: Caricato correttamente. Connect sarà attivo a momenti.

source: Loaded successfully. Enable Connect to activate.
it: Caricato correttamente. Abilita Connect per attivarlo.

source: Loading Timeout
it: Timeout caricamento

source: Loading to nozzle
it: Caricamento ugello

source: Lock the tool
it: Blocca lo strumento

source: Loosen pins
it: Allenta i perni

source: Loosen screws
it: Allenta le viti

source: Low temp
it: Temp bas

source: WI-FI SETTINGS
it: IMPOSTAZIONI WI-FI

source: 5V Voltage
it: Voltaggio 5V

source: Add Printer to Connect
it: Aggiungi Stampante a Connect

source: Alt fan correction
it: Correzione ventola Alt

source: A printer collision has been detected.
it: È stata rilevata una collisione di stampa.

source: Calibrate Dock 1
it: Calibra Dock 1

source: Calibrate Dock 2
it: Calibra Dock 2

source: Calibrate Dock 3
it: Calibra Dock 3

source: Calibrate Dock 4
it: Calibra Dock 4

source: Calibrate Dock 5
it: Calibra Dock 5

source: Calibration
it: Calibrazione

source: MAC Address
it: Indirizzo MAC

source: !! Careful, tools are hot !!
it: !! Attenzione, gli strumenti sono caldi !!

source: MANUAL SETTINGS
it: IMPOSTAZIONI MANUALI

source: MARLIN REQUEST TIMEOUT
it: TIMEOUT RICHIESTA MARLIN

source: Connected
it: Connesso

source: Crash Detection
it: Rilevamento Collisioni

source: Divide by Zero
it: Dividi per zero

source: Download and copy the firmware (.bbf) file to the USB flash drive. Insert the drive into the printer and turn it on or restart it. Confirm the installation of the new firmware.
it: Scarica e copia il file del firmware (.bbf) sulla chiavetta USB. Inserisci la chiavetta nella stampante e accendila o riavviala. Conferma l'installazione del nuovo firmware.

source: Downloading...
it: Scaricando...

source: Download the firmware (.bbf) file to the USB flash drive.
it: Scarica il file del firmware (.bbf) sulla chiavetta USB.

source: Do you want to repeat the last step and readjust the distance between the nozzle and heatbed?
it: Vuoi ripetere l'ultimo passo e regolare ancora la distanza tra ugello e piano riscaldato?

source: Do you want to use the current value? Current: %0.3f. Default: %0.3f. Click NO to use the default value (recommended)
it: Vuoi usare il valore attuale? Attuale: %0.3f. Default: %0.3f. Fare clic su NO per utilizzare il valore predefinito (consigliato)

source: Emulate Watchdog
it: Emula Watchdog

source: Enabled
it: Abilitato

source: ESP error
it: Errore ESP

source: EXIT
it: FINE

source: Filament
it: Filamento

source: MMU Version
it: Versione MMU

source: MMU filament loads
it: Caricamenti filamento MMU

source: Filament sensor not connected, check wiring.
it: Sensore di filamento non collegato, controllare il cablaggio.

source: Maintenance Reminder. Filament changes have reached 30k. Inspect and clean the extruder. Visit prusa.io/mmu-care
it: Promemoria per la manutenzione. I cambi di filamento hanno raggiunto le 30.000 unità. Ispeziona e pulisci l'estrusore. Visita prusa.io/mmu-care

source: Maintenance Reminder. Filament changes have reached main-plate lifespan. Inspect the part and ensure you have a spare plate available. Visit prusa.io/mmu-care
it: Promemoria Manutenzione. I cambi filamento hanno raggiunto il limite della piastra principale. Ispeziona il componente e assicurati di avere a disposizione una piastra di ricambio. Visita prusa.io/mmu-care

source: Make sure the filament is inserted through the sensor.
it: Accertati che il filamento attraversi il sensore.

source: Manual Settings
it: Impostazioni Manuali

source: Marlin client could not send message to Marlin server and timeout was reached.
it: Il client Marlin non è riuscito a inviare il messaggio al server Marlin ed è stato raggiunto il timeout.

source: Measurement failed.
it: Misurazione non riuscita.

source: Measuring Y resonance...
it: Misuro la risonanza Y...

source: Hotend Fan
it: Ventola hotend

source: How to update firmware?
it: Come aggiornare il firmware?

source: IPv4 Address
it: Indirizzo IPv4

source: IPv4 Gateway
it: Gateway IPv4

source: IPv4 Netmask
it: Netmask IPv4

source: LANGUAGE & TIME
it: LINGUA & ORA

source: Low
it: Basso

source: Mask
it: Maschera

source: Medium
it: Medio

source: Menu Timeout
it: Timeout Menù

source: More detail at
it: Maggiori dettagli su

source: Motor %c vibration reduced by %2d%%
it: Vibrazione motore %c ridotta del %2d%%

source: Max Chamber Temperature
it: Temperatura massima della camera

source: NETWORK SETUP
it: SETUP RETE

source: NEVER
it: MAI

source: NEXT
it: SUCCESSIVO

source: NO FW ON USB FLASH DRIVE
it: NESSUN FW SULLA MEMORIA USB

source: Move E
it: Sposta E

source: Move X
it: Sposta X

source: Move Y
it: Sposta Y

source: Move Z
it: Sposta Z

source: NETWORK
it: RETE

source: Not Calib
it: Non Calibrato

source: Now, let's calibrate the distance between the tip of the nozzle and the print sheet.
it: Ora, calibriamo la distanza tra la punta dell'ugello e il piano di stampa.

source: NOT NOW
it: NON ADESSO

source: NOW
it: ORA

source: Name
it: Nome

source: Net fail
it: Errore Rete

source: Next change in
it: Prossimo cambio tra

source: None
it: Nessuno

source: Not detected
it: Non rilevato

source: Park Current Tool
it: Parcheggia Strumento Attuale

source: Pick Tool 1
it: Scegli Strumento 1

source: Pick Tool 1 (Current)
it: Scegli Strumento 1 (Attuale)

source: Pick Tool 2
it: Scegli Strumento 2

source: Pick Tool 2 (Current)
it: Scegli Strumento 2 (Attuale)

source: Pick Tool 3 (Current)
it: Scegli Strumento 3 (Attuale)

source: Nozzle
it: Ugello

source: Nozzle 1 Temperature
it: Temperatura Ugello 1

source: Nozzle 2 Temperature
it: Temperatura Ugello 2

source: Nozzle PWM
it: PWM Ugello

source: Once
it: Una volta

source: Nozzle diameter
it: Diametro ugello

source: Nozzle doesn't seem to have round cross section. Make sure it is clean and perpendicular to the bed.
it: L'ugello non sembra avere una sezione trasversale rotonda. Assicurati che sia pulito e perpendicolare al piano.

source: Nozzle Temperature
it: Temperatura ugello

source: Select
it: Seleziona

source: Object %i
it: Oggetto %i

source: Tool 1
it: Strumento 1

source: Tool 2
it: Strumento 2

source: Tool 3
it: Strumento 3

source: Overcurrent detected on USB port.
it: Rilevata sovracorrente sulla porta USB.

source: Tools Changed
it: Strumento cambiato

source: Overcurrent detected on the MMU port, disconnect the device.
it: Rilevata sovracorrente sulla porta MMU, scollega il dispositivo.

source: PAUSE
it: PAUSA

source: Wi-Fi credentials (SSID and password) discovered on the USB flash drive. Would you like to connect your printer to Wi-Fi now?
it: Credenziali Wi-Fi (SSID e password) trovate sulla chiavetta USB. Vuoi collegare ora la tua stampante al Wi-Fi?

source: X-axis Filter
it: Filtro Asse X

source: X-axis Freq.
it: Freq. Asse X

source: Y-axis Freq.
it: Freq. Asse Y

source: PAUSED
it: IN PAUSA

source: PAUSING ...
it: IN PAUSA ...

source: PHASE STEPPING CALIBRATION
it: CALIBRAZIONE PHASE STEPPING

source: PRINTHEAD
it: TESTINA DI STAMPA

source: PRINTING ...
it: IN STAMPA ...

source: PURGE MORE
it: PULISCI DI PIÙ

source: Park Tool
it: Parcheggia Strumento

source: Parking selector
it: Posteggio selettore

source: Parking test failed. Please try again.
it: Test parcheggio fallito. Riprova.

source: Parking tool
it: Parcheggio strumento

source: Perfect!
it: Perfetto!

source: Perform filament sensors calibration? This discards previous filament sensors calibration.
it: Eseguire la calibrazione dei sensori del filamento? Questa operazione elimina la precedente calibrazione.

source: Performing cut
it: Eseguo taglio

source: Phase stepping calibration completed
it: Calibrazione Phase Stepping completata

source: Please follow the XY gantry alignment process in the manual.
it: Segui la procedura di allineamento del ponteggio XY descritta nel manuale.

source: Please install the belt dampeners to the left and right side of the printer.
it: Monta gli smorzatori della cinghia sul lato destro e sinistro della stampante.

source: Please open idler and remove filament manually
it: Apri l'idler e rimuovi il filamento manualmente

source: Please remove filament from filament sensor.
it: Rimuovi il filamento dal sensore di filamento.

source: Phase stepping defaults have been successfully restored.
it: Sono state ripristinate correttamente le impostazioni predefinite di Phase Stepping.

source: Please wait.
it: Attendere...

source: Post Print Filtration
it: Filtraggio Post Stampa

source: Post Print Filtration Duration
it: Durata della filtrazione post stampa

source: Power Failures
it: Interruzioni di corrente

source: Preparing blade
it: Preparo la lama

source: Preparing to ram
it: Preparazione al ram

source: Press CONTINUE and push filament into MMU.
it: Premi CONTINUA e spingi il filamento nella MMU.

source: Press CONTINUE and push filament into the extruder.
it: Premi CONTINUA e spingi il filamento nell'estrusore.

source: Previous Calibrations & Tests are not all done. Continue anyway?
it: Le calibrazioni e i test precedenti non sono stati completati. Continuare comunque?

source: Print Filtration
it: Filtraggio Stampa

source: Print Progress Screen
it: Schermata di avanzamento della stampa

source: Printer has detected multiple consecutive filament loading errors. We recommend checking Nextruder main-plate. Visit prusa.io/mmu-care
it: La stampante ha rilevato numerosi errori di caricamento del filamento consecutivi. Ti consigliamo di controllare la piastra principale del Nextruder. Visita prusa.io/mmu-care

source: Printer has detected multiple consecutive filament loading errors. We recommend checking the extruder. Visit prusa.io/mmu-care
it: La stampante ha rilevato più errori di caricamento del filamento consecutivi. Si consiglia di controllare l'estrusore. Visita prusa.io/mmu-care

source: Printing
it: In stampa

source: Protocol
it: Protocollo

source: Purging
it: Spurgo

source: Purging filament
it: Spurgo il filamento

source: Pushing filament
it: Spingo il filamento

source: Question
it: Domanda

source: REPLACE
it: SOSTITUISCI

source: RESTART
it: RICOMINCIA

source: RESUME
it: RIPRENDI

source: RETRY
it: RIPROVA

source: RGB Status Bar
it: Barra di stato RGB

source: RIGHT
it: DESTRA

source: Recommended shaper frequency for X axis:
it: Frequenza shaper consigliata per l'asse X:

source: Recommended shaper frequency for Y axis:
it: Frequenza shaper consigliata per l'asse Y:

source: Refused
it: Rifiutato

source: Reg. code
it: Codice Reg.

source: Reg. done
it: Reg. fatta

source: Reg. error
it: Errore Reg.

source: Registering
it: Registrazione

source: Remove belt dampeners
it: Rimuovere gli smorzatori della cinghia

source: Requires Filtration
it: Richiede il filtraggio

source: Reset Settings & Calibrations
it: Reset Impostazioni & Calibrazioni

source: Reset currents
it: Reset correnti

source: Reset directions
it: Reset direzioni

source: Restore Calibration from USB
it: Ripristino della calibrazione da USB

source: Retracting from FINDA
it: Retrazione da FINDA

source: Return
it: Ritorna

source: Returning selector
it: Ritorno selettore

source: SENSOR INFO
it: INFO SENSORE

source: SKIP
it: SALTA

source: SLOWLY
it: LENTAMENTE

source: STOPPED
it: INTERROTTO

source: SYSTEM
it: SISTEMA

source: Save Crash Dump
it: Salvare Crash Dump

source: Save and return
it: Salva ed esci

source: Saving to USB
it: Salvataggio su USB

source: Scanning
it: Scansione

source: Selecting filament slot
it: Selezione slot filamento

source: Selecting tool
it: Selezione strumento

source: Serial Number
it: Numero Seriale

source: Setting the printer up for the calibration. Please wait.
it: Impostazione della stampante per la calibrazione. Attendere.

source: Sheet Profile
it: Profilo piastra

source: Sheets
it: Piastre

source: Shipping Preparation
it: Preparazione alla spedizione

source: Side FSensor Remap
it: Rimappa FSensor laterale

source: Side Filament Sensor
it: Sensore filamento laterale

source: Side filament sensor not connected, check wiring.
it: Sensore di filamento laterale non collegato, controllare il cablaggio.

source: Some nozzle heater checks were disabled due to their hotend fan checks not having passed.
it: Alcuni controlli del riscaldatore dell'ugello sono stati disattivati perché i controlli della ventola dell'hotend non sono stati superati.

source: Sound Volume
it: Volume suono

source: Speed
it: Velocità

source: Static
it: Fisso

source: Static-left
it: Fisso a sinistra

source: Statistics
it: Statistiche

source: Stealth Mode
it: Modo Silenzioso

source: Switched fans
it: Ventole invertite

source: TLS error
it: Errore TLS

source: TOOL %d
it: STRUMENTO %d

source: TOOLHEAD
it: TESTINA STRUMENTO

source: Tap the nozzle
it: Tocca l'ugello

source: Tap the nozzle on beep
it: Tocca l'ugello al bip

source: Temp. show zero
it: Temp. mostra zero

source: Testing filament
it: Provo il filamento

source: The calibrated dock is illuminated at the bottom and front side is flashing with white color. Loosen and remove the dock pins.
it: Il dock calibrato è illuminato in basso e la parte anteriore lampeggia di colore bianco. Allenta e rimuovi i perni del dock.

source: The file is corrupt.
it: File corrotto.

source: System
it: Sistema

source: The heater test will be skipped due to the failed hotend fan check. You may continue, but we strongly recommend resolving this issue before you start printing.
it: Il test del riscaldatore verrà saltato a causa del mancato controllo della ventola dell'hotend. Puoi continuare, ma ti consigliamo di risolvere questo problema prima di iniziare a stampare.

source: Tighten only the bottom screw on the right side of the dock pillar.
it: Stringi solo la vite inferiore sul lato destro della colonna del dock.

source: Tighten screw
it: Stringere la vite

source: Tighten the top dock screw at the right side of the pillar Be careful in next step the printer will be moving
it: Stringi la vite superiore del dock sul lato destro della colonna Fai attenzione al prossimo passo: la stampante si muoverà

source: Time Zone Hour Offset
it: Offset delle ore del fuso orario

source: Time Zone Summertime
it: Orario estivo

source: To learn more about the phase stepping calibration process, read the article:
it: Per saperne di più sulla calibrazione Phase Stepping, leggere l'articolo:

source: The printer will now save all logs to file until restart. Log file: %s
it: La stampante ora salverà tutti i registri in un file fino al riavvio. File di registro: %s

source: Toolhead Filament Sensor
it: Sensore Filamento Testina

source: Touch driver failed to initialize, touch functionality disabled
it: Driver Touch non inizializzato, funzione touch disattivata

source: Turn the knob to move Z-axis
it: Ruota la manopola per spostare l'asse Z

source: UNLOAD
it: SCARICA

source: UP
it: SU

source: Unauthorized
it: Non autorizzato

source: Unload
it: Scarica

source: Unload Filament
it: Scarica filamento

source: Unloading
it: Scaricamento

source: Unloading filament
it: Scaricando filamento

source: Unloading to FINDA
it: Scarico in FINDA

source: Unloading to pulley
it: Scarico su puleggia

source: Verify GCode
it: Verifica GCode

source: Waiting for nozzle to cool down
it: In attesa che l'ugello si raffreddi

source: Waiting for temperature
it: In attesa della temperatura

source: I2C SEND BUSY
it: INVIO I2C OCCUPATO

source: Was filament unload successful?
it: Filamento scaricato correttamente?

source: We suggest opening the online guide for the first-time calibration.
it: Suggeriamo di aprire la guida online per la prima calibrazione.

source: We will need your help with this test. You will be asked to tap the nozzle. Don't worry; it is going to be cold.
it: Per questo test ci serve il tuo aiuto. Ti verrà chiesto di toccare l'ugello. Non ti preoccupare, sarà freddo.

source: Wi-Fi Wizard
it: Wizard Wi-Fi

source: Wrong
it: Sbagliata

source: X Axis
it: Asse X

source: X current (0 default)
it: Corrente X (0 default)

source: X-axis
it: Asse X

source: X-axis direction
it: Direzione asse X

source: axis frequency is too high. Please check your HW setup. If the problem prevails, contact the customer support.
it: frequenza asse troppo alta. Controlla la configurazione hardware. Se il problema persiste, contatta l'assistenza clienti.

source: LED MEMORY ERROR
it: ERRORE MEMORIA LED

source: If the filament sensor is unresponsive, clean it from debris.
it: Se il sensore del filamento non risponde, puliscilo dai detriti.

source: If the filament sensor is unresponsive, clean it from debris. Alternatively, you can disable it.
it: Se il sensore di filamento non risponde, pulirlo dai detriti. In alternativa, è possibile disattivarlo.

source: Loading filament
it: Caricamento del filamento

source: Logging has been turned off. You can now safely remove the USB drive.
it: La registrazione è stata disattivata. Ora è possibile rimuovere in modo sicuro l'unità USB.

source: Measured temperature is not matching expected value. Check if the thermistor is in contact with the heaterblock. In case of damage, replace it.
it: La temperatura misurata non corrisponde al valore previsto. Controllare che il termistore sia a contatto con l'heaterblock. In caso di danni, sostituirlo.

source: Minimum Power
it: Potenza Minima

source: New FW available
it: Nuovo FW disponibile
