Repository: prusa3d/Prusa-Firmware-Buddy
Catalog: src/lang/po/*/Prusa-Firmware-Buddy_*.po
Languages: it

source: TMC DRIVER ERROR
it: ERRORE DRIVER TMC

source: TMC DRIVER RESET
it: RESET DRIVER TMC

source: TMC driver for the Idler motor is almost overheating. Make sure there is sufficient airflow near the MMU board.
it: Il driver TMC per il motore Idler si sta surriscaldando. Assicurati che ci sia un flusso d'aria sufficiente vicino alla scheda MMU.

source: TMC driver for the Idler motor is not responding. Try resetting the MMU. If the issue persists contact support.
it: Il driver TMC per il motore Idler non risponde. Prova a resettare la MMU. Se il problema persiste, contatta l'assistenza.

source: TMC driver for the Idler motor was restarted. There is probably an issue with the electronics. Check the wiring and connectors.
it: Il driver TMC per il motore Idler è stato riavviato. Probabilmente c'è un problema con l'elettronica. Controlla il cablaggio e i connettori.

source: TMC driver for the Pulley motor is almost overheating. Make sure there is sufficient airflow near the MMU board.
it: Il driver TMC per il motore della puleggia si sta surriscaldando. Assicurati che ci sia un flusso d'aria sufficiente vicino alla scheda MMU.

source: TMC driver for the Pulley motor is not responding. Try resetting the MMU. If the issue persists contact support.
it: Il driver TMC per il motore della puleggia non risponde. Prova a resettare la MMU. Se il problema persiste, contatta l'assistenza.

source: TMC driver for the Pulley motor is overheated. Cool down the MMU board and reset MMU.
it: Il driver TMC per il motore della puleggia è surriscaldato. Raffredda la scheda MMU e resetta la MMU.

source: TMC driver for the Pulley motor was restarted. There is probably an issue with the electronics. Check the wiring and connectors.
it: Il driver TMC per il motore Puleggia è stato riavviato. Probabilmente c'è un problema con l'elettronica. Controlla il cablaggio e i connettori.

source: TMC driver for the Selector motor is almost overheating. Make sure there is sufficient airflow near the MMU board.
it: Il driver TMC per il motore del Selettore si sta surriscaldando. Assicurati che ci sia un flusso d'aria sufficiente vicino alla scheda MMU.

source: TMC driver for the Selector motor is not responding. Try resetting the MMU. If the issue persists contact support.
it: Il driver TMC per il motore del selettore non risponde. Prova a resettare la MMU. Se il problema persiste, contatta l'assistenza.

source: TMC driver for the Selector motor is overheated. Cool down the MMU board and reset MMU.
it: Il driver TMC per il motore Selettore è surriscaldato. Raffredda la scheda MMU e resetta la MMU.

source: TMC driver for the Selector motor was restarted. There is probably an issue with the electronics. Check the wiring and connectors.
it: Il driver TMC per il motore Selettore è stato riavviato. Probabilmente c'è un problema con l'elettronica. Controlla il cablaggio e i connettori.

source: The Idler cannot home properly. Check for anything blocking its movement.
it: Idler non riesce a tornare in home correttamente. Verifica che non vi sia nulla che ne blocchi il movimento.

source: Tool %d offset %c: %.3f is out of bounds [%.3f, %.3f].
it: Offset %c strumento %d : %.3f è fuori dai limiti [%.3f, %.3f].

source: Please complete Calibrations & Tests before using the printer.
it: Completa le calibrazioni e i test prima di utilizzare la stampante.

source: UNLOAD MANUALLY
it: SCARICA MANUALMENTE

source: Unexpected error occurred.
it: Si è verificato un errore imprevisto.

source: You can determine the nozzle diameter by counting the markings (dots) on the nozzle: 0.40 mm nozzle: 3 dots 0.60 mm nozzle: 4 dots For more information, visit prusa.io/nozzle-types
it: Puoi determinare il diametro dell'ugello contando i segni (punti) sull'ugello: Ugello da 0,40 mm: 3 punti Ugello da 0,60 mm: 4 punti Per ulteriori informazioni, visita il sito prusa.io/nozzle-types

source: You can press 'Finish' to continue connecting on the background.
it: Puoi premere "Fine" per continuare a connetterti in background.

source: Please remove the belt dampeners.
it: Rimuovi gli smorzatori della cinghia.

source: Printer is busy. Please try repeating the action later.
it: La stampante è occupata. Prova a ripetere l'operazione più tardi.

source: Reloading filament
it: Ricarico filamento

source: Side Filament sensor
it: Sensore filamento laterale

source: Stuck Filament Detection
it: Rilevamento filamento bloccato

source: The RPM test has failed, check both fans are free to spin and connected correctly.
it: Il test RPM non è riuscito, controlla che entrambe le ventole possano girare e che siano collegate correttamente.

source: Testing fan rotation on 100% power, please wait.
it: Prova la rotazione della ventola con il 100% di potenza, attendi.

source: Testing fan rotation on 40% power, please wait.
it: Prova la rotazione della ventola con il 40% di potenza, attendi.

source: This G-code was set up for another filament type.
it: Questo G-code è impostato per un altro tipo di filamento.

source: Tighten by %.1f turns
it: Stringere di %.1f giri

source: Tool 1
it: Strumento 1

source: Tool 2
it: Strumento 2

source: Tool 3
it: Strumento 3

source: Tool 4
it: Strumento 4

source: Tool 5
it: Strumento 5

source: Total General Fails
it: Totale errori generali

source: Waiting for user input
it: Attesa azione utente

source: Waiting for chamber temperature
it: In attesa della temperatura della camera

source: axis frequency is too low. Please tighten the belt.
it: frequenza asse troppo bassa. Tendi la cinghia.

source: disabled / %ld
it: disabilitato / %ld

source: disconnected / %ld
it: disconnesso / %ld

source: please wait
it: attendere

source: uncalibrated / %ld
it: non calibr. / %ld

source: uninitialized / %ld
it: non inizial. / %ld

source: closed
it: chiuso

source: detached
it: staccato

source: open
it: aperto

source: Clean steel sheet.
it: Pulire lastra d'acciaio.

source: Cut Filament
it: Taglia filamento

source: During the test, the heatbed, and extruder will move in full range. Printer may vibrate and be noisier during homing.
it: Durante il test, il piano riscaldato e l'estrusore si muoveranno in tutta la loro ampiezza. La stampante potrebbe vibrare e risultare più rumorosa durante l'homing.

source: Erasing configuration, it will take some time...
it: Cancello configurazione, richiede un po' di tempo...

source: Not enough current for the Idler TMC driver. There is probably an issue with the electronics. Check the wiring and connectors.
it: Corrente insufficiente per il driver TMC Idler. È probabile che ci sia un problema con l'elettronica. Controlla il cablaggio e i connettori.

source: User
it: Utente

source: WARNING TMC TOO HOT
it: ATTENZIONE TMC CALDO

source: Bootloader Version %d.%d.%d Buddy Board %d %s
it: Vers. Bootloader %d.%d.%d Scheda Buddy %d.%d.%d %s

source: ABORTING ...
it: INTERRUZIONE ...

source: Comm err
it: Err. comunicazione

source: FILAMENT EJECTED
it: FILAMENTO ESPULSO

source: FINDA didn't switch off while unloading filament. Try unloading manually. Ensure filament can move and FINDA works.
it: FINDA non disattivata durante scaric. filamento. Prova a scaricare manualmente. Verifica che il fil. possa muoversi e che FINDA funzioni.

source: FINDA didn't trigger while loading the filament. Ensure the filament can move and FINDA works.
it: FINDA non attivata durante il caric. del filamento. Verif che il fil. possa muoversi e che FINDA funzioni.

source: FINISHED
it: COMPLETATO

source: FSENSOR DIDNT TRIGG.
it: FSENSOR NON ATTIVATO

source: Filament detected unexpectedly. Ensure no filament is loaded. Check the sensors and wiring.
it: Filamento rilevato non previsto. Assicurati che non sia stato caricato alcun filamento. Controlla i sensori e il cablaggio.

source: Filament sensor didn't switch off while unloading filament. Ensure filament can move and the sensor works.
it: Il sensore di filamento non si è spento durante lo scaricamento. Verifica che il filamento possa muoversi e che il sensore funzioni.

source: Filament sensor didn't trigger while loading the filament. Ensure the sensor is calibrated and the filament reached it.
it: Sensore di filamento non attivato durante il caricamento del filamento. Assicurati che il sensore sia calibrato e che il filamento lo raggiunga.

source: IDLER CANNOT HOME
it: HOME IDLER NON RIUSCITO

source: IDLER CANNOT MOVE
it: IDLER BLOCCATO

source: MMU BL Status
it: Stato MMU BL

source: Nextruder Maintenance
it: Manutenzione Nextruder

source: Failed to home the extruder in Z-axis.
it: Homing estrusore su asse Z non riuscito.

source: %d Bed Heater Test
it: %d Test riscaldatore piano

source: Loading settings finished.
it: Caricamento delle impostazioni completato.

source: Tool 4
it: Strumento 4

source: Check the heater and thermistor wiring for potential damage.
it: Controlla che il cablaggio del riscaldatore e del termistore non sia danneggiato.

source: (Custom)
it: (Personalizzato)

source: FIL. ALREADY LOADED
it: FIL. GIÀ CARICATO

source: FINDA DIDNT TRIGGER
it: FINDA NON ATTIVATA

source: FINDA FILAM. STUCK
it: FINDA FILAM. BLOCC

source: FILTER CHANGE
it: CAMBIO FILTRO

source: FSENSOR FIL. STUCK
it: FSENSOR FIL. BLOCC

source: FSENSOR TOO EARLY
it: FSENSOR IN ANTICIPO

source: %d Loadcell Test
it: %d Test Cella di carico

source: %d X Axis Test
it: %d Test asse X

source: Filament sensor triggered too early while loading to extruder. Check there isn't anything stuck in PTFE tube. Check that sensor reads properly.
it: Il sensore del filamento si è attivato troppo presto durante il caricamento nell'estrusore. Controlla che non ci sia nulla di incastrato nel tubo PTFE. Controlla che il sensore legga correttamente.

source: %d Z Alignment Calibration
it: %d Calibrazione allineamento Z

source: A crash dump is being saved.
it: Verrà salvato un crash dump.

source: Active Interface
it: Interfaccia attiva

source: INVALID TOOL
it: STRUMENTO NON VALIDO

source: Internal runtime error. Try resetting the MMU or updating the firmware.
it: Errore interno di runtime. Prova a resettare la MMU o ad aggiornare il firmware.

source: If the filter on your enclosure is close to its expiration time (600 h), please change it for a new one.
it: Se il filtro dell'involucro è prossimo alla scadenza (600 h), sostituirlo con uno nuovo.

source: Adjust the nozzle height above the heatbed by turning the knob
it: Regola l'altezza ugello sopra il piano ruotando la manopola

source: Loading to extruder failed. Inspect the filament tip shape. Refine the sensor calibration, if needed.
it: Caricamento nell'estrusore fallito. Ispeziona la forma della punta del filamento. Se necessario, perfeziona la calibrazione del sensore.

source: MMU FW UPDATE NEEDED
it: AGG FW MMU RICHIESTO

source: MMU Firmware internal error, please reset the MMU.
it: Errore interno firmware MMU, resettare la MMU.

source: MMU MCU ERROR
it: ERRORE MCU MMU

source: MMU MCU UNDERPOWER
it: MMU MCU SOTTOTENSIONE

source: MMU MCU detected a 5V undervoltage. There might be an issue with the electronics. Check the wiring and connectors
it: La MCU MMU ha rilevato una sottotensione di 5V. Potrebbe esserci un problema con l'elettronica. Controlla il cablaggio e i connettori

source: MMU NOT RESPONDING
it: MMU NON RISPONDE

source: MMU detected a power-related issue. Check the wiring and connectors. If the issue persists, contact support.
it: La MMU ha rilevato un problema di alimentazione. Controlla il cablaggio e i connettori. Se il problema persiste, contatta l'assistenza.

source: Always
it: Sempre

source: BELT TUNING
it: REGOLAZIONE CINGHIA

source: Prime tower %dg
it: Torre di Priming %dg

source: Preload to MMU Advanced
it: Precarico su MMU Avanzato

source: Chamber Overheating
it: Surriscaldamento Camera

source: Chamber Temperature Is Critical
it: La temperatura della camera è critica

source: Chamber temperature above safety limit. Ensure better ventilation.
it: Temperatura della camera superiore al limite di sicurezza. Provvedere a una migliore ventilazione.

source: Selector can't move due to FINDA detecting a filament. Make sure no filament is in Selector and FINDA works properly.
it: Il selettore non può muoversi perché FINDA rileva un filamento. Assicurati che non ci sia alcun filamento nel Selettore e che la FINDA funzioni correttamente.

source: Click the knob to close
it: Premi la manopola per chiudere

source: TMC driver for the Idler motor is overheated. Cool down the MMU board and reset MMU.
it: Il driver TMC per il motore Idler è surriscaldato. Raffredda la scheda MMU e resetta la MMU.

source: Test All
it: Prova tutti

source: The Idler cannot move properly. Check for anything blocking its movement. Check if the wiring is correct.
it: L'idler non riesce a muoversi correttamente. Controlla che non ci sia nulla che ne blocchi il movimento. Controlla che cablaggio sia corretto.

source: The MMU firmware version is incompatible with the printer's FW. Update to compatible version.
it: La versione del firmware della MMU non è compatibile con il FW della stampante. Aggiorna alla versione compatibile.

source: The Selector cannot home properly. Check for anything blocking its movement.
it: Il selettore non riesce a tornare in home correttamente. Verifica che non vi sia nulla che ne blocchi il movimento.

source: The Selector cannot move. Check for anything blocking its movement. Check if the wiring is correct.
it: Il Selettore non può muoversi. Controlla che non ci sia nulla che ne blocchi il movimento. Controlla che il cablaggio sia corretto.

source: To learn how to change XL enclosure filter, please visit: prusa.io/xl-filter
it: Per sapere come sostituire il filtro dell'Enclosure XL, visitare il sito: prusa.io/xl-filter

source: Try checking belt tension or debris on the axes.
it: Controlla la tensione della cinghia o i residui sugli assi.

source: Try checking belt tension or decreasing sensitivity in the tune menu.
it: Prova a controllare la tensione della cinghia o a diminuire la sensibilità nel menu di regolazione.

source: Touch
it: Tocco

source: Computing best shaper...
it: Elaborazione del miglior shaper...

source: XY probing failed due to the low measurement stability.
it: Rilevamento XY non riuscito a causa di una bassa stabilità di misurazione.

source: Do you want to reset the extruder maintenance reminder?
it: Vuoi resettare il promemoria per la manutenzione dell'estrusore?

source: Dock Position
it: Posizione Dock

source: Dock successfully calibrated.
it: Dock calibrato correttamente.

source: Enclosure fan not spinning. Check it for possible debris, then inspect the wiring.
it: La ventola dell'involucro non gira. Verifica la presenza di eventuali detriti, quindi ispeziona il cablaggio.

source: Extruder motor is not spinning on tool %d
it: Il motore dell'estrusore non gira sullo strumento %d

source: - DNS Server
it: - Server DNS

source: Connect Host
it: Host Connect

source: Connect IP
it: IP Connect

source: Change Filter
it: Cambia Filtro

source: Filament sensor not ready: perform calibration first.
it: Sensore di filamento non pronto: eseguire prima la calibrazione.

source: Enclosure Settings
it: Impostazioni Enclosure

source: Fan Rotation
it: Rotazione Ventola

source: HEPA Filter Check
it: Controllo Filtro HEPA

source: DNS Server
it: Server DNS

source: Finishing buffered gcodes
it: Completamento dei gcode in buffer

source: Dry run (no extrusion)
it: Prova a secco (senza estrusione)

source: Testing enclosure fan
it: Test ventola enclosure

source: G-CODE METRICS CONFIG CHANGE
it: MODIFICA CONFIGURAZIONE METRICHE G-CODE

source: NETWORK STATUS
it: STATO RETE

source: Gcode is trying to change metrics configuration. Allow the changes?
it: Il Gcode sta cercando di modificare la configurazione delle metriche. Consentire le modifiche?

source: Pick Tool 3
it: Scegli Strumento 3

source: Pick Tool 4
it: Scegli Strumento 4

source: Pick Tool 4 (Current)
it: Scegli Strumento 4 (Attuale)

source: Pick Tool 5
it: Scegli Strumento 5

source: Pick Tool 5 (Current)
it: Scegli Strumento 5 (Attuale)

source: Preheat Error
it: Errore preheat

source: Print stopped
it: Stampa arrestata

source: General Fails in Print
it: Errori generali nella stampa

source: Running the phase stepping calibration to reduce vibrations. Please wait...
it: Eseguo la calibrazione del phase stepping per ridurre le vibrazioni. Attendi...

source: Takes too long, will skip soon.
it: Richiede troppo tempo, verrà saltato a breve.

source: Test bsod() Function
it: Test Funzione bsod()

source: The filament will be unloaded automatically.
it: Il filamento verrà scaricato automaticamente.

source: There was an error connecting to the Wi-Fi.
it: Si è verificato un errore di connessione al Wi-Fi.

source: Trigger Redscreen
it: Attiva la schermata rossa

source: Wi-Fi Status
it: Stato Wi-Fi

source: Heatbed tile no. %d: Unknown error: %d
it: Piastrella del piano riscaldato no. %d: Errore sconosciuto: %d

source: Heating
it: Riscaldamento

source: BED LEVEL CORRECTION
it: CORREZIONE LIVELLO PIANO

source: Wrong hardware
it: Hardware errato

source: ALL
it: TUTTI

source: Adjust
it: Regola

source: Aligning tool
it: Allineamento strumento

source: Back
it: Indietro

source: Bootloader Version
it: Versione Bootloader

source: Buddy Board
it: Scheda Buddy

source: Hostname
it: Nome Host

source: Loosen the two screws on the right side of the dock pillar (marked in orange) using the uni-wrench.
it: Allenta le due viti sul lato destro della colonna del dock (segnate in arancione) utilizzando la chiave universale.

source: Loud
it: Forte

source: MCU in Dwarf is overheated, likely due to exceeding the printer's operating temperature. Prevent overheating for optimal performance.
it: La MCU della Dwarf è surriscaldata, probabilmente a causa del superamento della temperatura di esercizio della stampante. Evita il surriscaldamento per ottenere prestazioni ottimali.

source: MCU in Modular Bed is overheated, likely due to exceeding the printer's operating temperature. Prevent overheating for optimal performance.
it: La MCU del piano modulare è surriscaldata, probabilmente a causa del superamento della temperatura di esercizio della stampante. Evita il surriscaldamento per ottenere prestazioni ottimali.

source: ACCELEROMETER COMMUNICATION FAILED
it: COMUNICAZIONE CON L'ACCELEROMETRO FALLITA

source: All
it: Tutto

source: Allocation of dynamic buffer for PNG failed - out of memory.
it: Allocazione del buffer dinamico per il PNG non riuscita - memoria esaurita.

source: MODULAR BED ERROR
it: ERRORE PIANO MODULARE

source: Overcurrent detected.
it: Rilevata sovracorrente.

source: Assist
it: Assistito

source: Adv. filtration
it: Filtraggio Avanz.

source: Power failure
it: Interruzione di corrente

source: Preheat Temp
it: Temperatura di preriscaldamento

source: Puppy %s not responding
it: Puppy %s non risponde

source: Puppy discovery error. No puppy found
it: Errore di ricerca del puppy. Nessun puppy trovato

source: Puppy uses incompatible bootloader protocol %04x, Buddy FW requires %04x
it: Puppy utilizza un protocollo bootloader incompatibile %04x, Il FW Buddy richiede %04x

source: The HEPA filter has expired. Change the HEPA filter before your next print. Visit prusa.io/xl-filter for more information.
it: Il filtro HEPA è esaurito. Cambiare il filtro HEPA prima della prossima stampa. Per ulteriori informazioni, visitare prusa.io/xl-filter.

source: The HEPA filter is nearing the end of its life span (100 hours of printing time remaining). We recommend purchasing a new one. Visit prusa.io/xl-filter for more information.
it: Il filtro HEPA sta per esaurire la sua durata (100 ore di stampa residue). Si consiglia di acquistarne uno nuovo. Per ulteriori informazioni, visitare prusa.io/xl-filter.

source: The file seems to be a binary gcode with a wrong suffix.
it: Il file sembra essere un gcode binario con un suffisso errato.

source: Toolchanger problem has been detected. Park all tools to docks and leave the carriage free.
it: Rilevato un problema al Toolchanger. Parcheggia tutti gli strumenti nei dock e lascia libero il carrello.

source: Unable to start puppy application
it: Impossibile avviare applicazione puppy

source: Unassigned puppy found
it: Rilevato puppy non assegnato

source: Unexpected invalid current.
it: Corrente non valida imprevista.

source: Unknown puppy type
it: Tipo di puppy sconosciuto

source: Waiting for fingerprint timed out
it: Timeout attesa fingerprint

source: Waiting for puppies to start timed out
it: Timeout attesa avvio dei puppy

source: XL Buddy 5V Current
it: XL Buddy Corrente 5V

source: Y Axis
it: Asse Y

source: Y-axis
it: Asse Y

source: Y-axis Filter
it: Filtro Asse Y

source: You did not tap the nozzle or you tapped it too soon. Retry?
it: Non hai toccato l'ugello o lo hai toccato troppo presto. Riprovare?

source: Z Axis
it: Asse Z

source: Z current
it: Corrente Z

source: Z height
it: Altezza Z

source: Z-axis
it: Asse Z

source: Z-axis calibration
it: Calibrazione asse Z

source: Z-axis direction
it: Direzione asse Z

source: CHAMBER MAXTEMP ERROR
it: ERRORE MAXTEMP CAMERA

source: Bed Temperature
it: Temperatura piano

source: CHAMBER FILTRATION
it: FILTRAGGIO CAMERA

source: Calibrations & Tests
it: Calibrazioni e test

source: Chamber Fan 2
it: Ventola Camera 2

source: Chamber Fans
it: Ventole della camera

source: Chamber Fans Limit
it: Limite Ventole Camera

source: Chamber Filtration
it: Filtraggio Camera

source: ERR Helping filament
it: ERR Aiuto filamento

source: ERR Internal
it: ERR Interno

source: ERR TMC failed
it: ERR TMC non riuscito

source: Erasing everything, it will take some time...
it: Cancello tutto, richiede un po' di tempo...

source: %d Fan Test
it: %d Test ventola

source: Error saving crash dump report to the USB drive. Please reinsert the USB drive and try again.
it: Errore salvando il rapporto di crash dump sul drive USB. Reinserire la chiavetta USB e riprovare.

source: FACTORY RESET
it: RESET DI FABBRICA

source: %d Nozzle Heaters Test
it: %d Test riscaldatore ugello

source: Do you want to reset the Nextruder main-plate maintenance reminder?
it: Vuoi resettare il promemoria per la manutenzione della piastra principale del Nextruder?

source: Input Voltage
it: Voltaggio d'ingresso

source: Inserting
it: Inserimento

source: Measuring belt tension
it: Misurazione della tensione della cinghia

source: Moving selector
it: Muovo il selettore

source: Network
it: Rete

source: No crash dump to save.
it: Nessun crash dump da salvare.

source: Dwarf board encountered the following problem: %s
it: La scheda Dwarf ha riscontrato il seguente problema: %s

source: Prusa Connect - printer setup
it: Prusa Connect - configurazione stampante

source: Registration successful, continue at connect.prusa3d.com
it: Registrazione avvenuta correttamente, continua su connect.prusa3d.com

source: FW update
it: Aggiornamento FW

source: Fail Stats
it: Stat. fallimenti

source: FS Troubleshooting
it: Risoluzione problemi FS

source: FSensors Disabled
it: Sensori Fil. Disabilitati

source: Fil. Sensor Troubleshooting
it: Risoluzione problemi Sensore fil.

source: Filament Sensors Disabled
it: Sensori filamento Disabilitati

source: Filament sensors are disabled. Enable them manually after printing.
it: I sensori del filamento sono disabilitati. Abilitali manualmente dopo la stampa.

source: Filtration fan
it: Ventola di filtraggio

source: YES
it: SI

source: You can continue printing. If the issue persists, repeat this procedure again.
it: Puoi continuare a stampare. Se il problema persiste, ripeti nuovamente questa procedura.

source: Gcode Cropped
it: Gcode Troncato

source: HOTEND HEATER OVERCURRENT
it: SOVRACORRENTE RISCALDATORE HOTEND
