Repository: prusa3d/Prusa-Firmware-Buddy
Catalog: src/lang/po/*/Prusa-Firmware-Buddy_*.po
Languages: it

source: Phase stepping not ready: perform calibration first.
it: Phase stepping non pronto: esegui prima la calibrazione.

source: Perform filament change now?
it: Effetturare il cambio di filamento adesso?

source: Post-print Duration
it: Durata Post Stampa

source: Post-print Filtration
it: Filtraggio Post Stampa

source: Post-print Power
it: Potenza Post Stampa

source: Print Fan
it: Ventola di stampa

source: A crash dump report (file dump.bin) has been saved to the USB drive.
it: Un rapporto di crash dump (file dump.bin) è stato salvato sul drive USB.

source: Printhead
it: Testina di stampa

source: Reset complete. The system will now restart.
it: Ripristino completato. Il sistema verrà riavviato.

source: Sandwich 5V Current
it: Sandwich Corrente 5V

source: Save Logs To File
it: Salva i registri su file

source: Sensor Info
it: Info sensore

source: Serial Printing Screen
it: Schermo di stampa seriale

source: SuperPINDA sensor is probably broken or disconnected, could not home Z-axis properly.
it: Il sensore SuperPINDA è probabilmente guasto o scollegato, e non è riuscito a individuare correttamente l'asse Z.

source: Failed to enable metrics. Check your settings.
it: Impossibile abilitare le metriche. Controllare le impostazioni.

source: Test Errors
it: Test Errori

source: To learn more including firmware downgrade, please visit:
it: Per saperne di più sul downgrade del firmware, visita il sito:

source: Tool Filament sensor
it: Sensore filamento Strumento

source: Toolhead
it: Testina

source: Turn on Phase stepping uncalibrated?
it: Attivare Phase stepping non calibrato?

source: Turn the logging off before disconnecting the USB drive, or you risk damaging the filesystem!
it: Spegnere la registrazione prima di scollegare l'unità USB, altrimenti si rischia di danneggiare il filesystem!

source: FW Update
it: Aggiornamento FW

source: Power panic detected on startup. Check power panic cable.
it: Rilevato power panic all'avvio. Controlla il cavo power panic.

source: USB drive not connected! Please insert a USB drive with a valid firmware file.
it: Unità USB non connessa! Inserisci un'unità USB con un file firmware valido.

source: Canceled
it: Annullato

source: Cancel Current
it: Annulla Corrente

source: Continue
it: Continua

source: Disconnect
it: Disconnetti

source: FAILURE STATISTICS
it: STATISTICHE GUASTI

source: All Tools
it: Tutti gli Strumenti

source: %d Filament Sensor Calibration
it: %d Calibrazione sensore filamento

source: %d Gears Calibration
it: %d Calibrazione Ingranaggi

source: %d Y Axis Test
it: %d Test asse Y

source: %d Z Axis Test
it: %d Test asse Z

source: Flow Factor
it: Fattore di flusso

source: File read error
it: Errore di lettura del file

source: Heatbed
it: Piano riscaldato

source: Heatbed Temperature
it: Temperatura piano riscaldato

source: Belt Tuning
it: Regolazione della cinghia

source: Heating...
it: Riscaldamento...

source: Calibrate Dock Position
it: Calibra posizione Dock

source: Chamber Lights
it: Luci della camera

source: Chamber Temperature
it: Temperatura della camera

source: Chamber temperature critical. Aborting print to prevent printer damage.
it: Temperatura della camera critica. Interruzione della stampa per evitare danni alla stampante.

source: LANGUAGES
it: LINGUE

source: Invalid BGCODE file header
it: Intestazione del file BGCODE non valida

source: LEFT
it: SINISTRA

source: Load Filament
it: Carica filamento

source: Close the door to prevent air drafts, burns and other undesirable effects.
it: Chiudi lo sportello per evitare correnti d'aria, scottature e altri effetti indesiderati.

source: Loading test
it: Test Caricamento

source: DOOR OPEN
it: SPORTELLO APERTO

source: Display Refresh Speed
it: Velocità di aggiornamento del display

source: MBed MCU Temp
it: Temp MBed MCU

source: Material
it: Materiale

source: Pause
it: Pausa

source: Pausing...
it: In pausa...

source: ESP doesn't seem to be connected.
it: L'ESP non sembra essere collegato.

source: Print Fan Speed
it: Velocità ventola di stampa

source: Print Speed
it: Velocità di Stampa

source: Reprint
it: Ristampa

source: Resume
it: Riprendi

source: Resuming...
it: Ripresa...

source: FILAMENT SENSORS
it: SENSORI DI FILAMENTO

source: SELECT LANGUAGE
it: SELEZIONA LINGUA

source: SERIAL PRINTING
it: STAMPA SERIALE

source: SETTINGS
it: IMPOSTAZIONI

source: Select when you want to automatically flash updated firmware from USB flash disk.
it: Seleziona quando vuoi aggiornare automaticamente il nuovo firmware da mem. USB.

source: Error
it: Errore

source: Skip
it: Salta

source: Factory Reset
it: Ripristino impostazioni di fabbrica

source: Failed
it: Non riuscito

source: Filtration Fan
it: Ventola di filtraggio

source: Tool 1 Flow Factor
it: Fattore di flusso Strumento 1

source: Tool 2 Flow Factor
it: Fattore di flusso Strumento 2

source: Tool 3 Flow Factor
it: Fattore di flusso Strumento 3

source: Tool 4 Flow Factor
it: Fattore di flusso Strumento 4

source: Tool 5 Flow Factor
it: Fattore di flusso Strumento 5

source: Tune
it: Regola

source: Used Amount
it: Quantità Usata

source: Heater Current
it: Corrente Riscaldatore

source: LOADCELL MEASURE FAILED
it: MISURA CELLA DI CARICO FALLITA

source: Pick/Park Tool
it: Scegli/Parcheggia Strumento

source: Preparing
it: Preparazione

source: Print Time
it: Tempo di stampa

source: RGB Side Strip
it: Striscia RGB laterale

source: RGB Side Strip Dimming
it: Dimmerazione striscia RGB laterale

source: Registration to Prusa Connect failed due to:
it: La registrazione a Prusa Connect non è riuscita a causa di:

source: Repeated collision has been detected. Do you want to resume or pause the print?
it: Rilevate collisioni ripeture. Vuoi riprendere o mettere in pausa la stampa?

source: Replace filament
it: Sostituire filamento

source: Restore Defaults
it: Ripristina le impostazioni predefinite

source: Set Ready
it: Imposta come Pronta

source: Setting the tare failed. Check the loadcell wiring and connection.
it: Impostazione tara non riuscita. Controlla il cablaggio e il collegamento della cella di carico.

source: Status
it: Stato

source: TOOLS SETTINGS
it: IMPOSTAZIONI STRUMENTO

source: Temperature
it: Temperatura

source: The G-code isn't fully compatible
it: Il G-code non è pienamente compatibile

source: The bed doesn't seem to be aligned properly. Run Z alignment procedure?
it: Sembra che il piano non sia allineato correttamente. Vuoi eseguire la procedura di allineamento Z?

source: The filament seems to be stuck, please unload it from nextruder and load it again.
it: Il filamento sembra essere bloccato, per favore scaricalo dal nextruder e caricalo di nuovo.

source: The heatbed cooled down during the power outage, printed object might have detached. Inspect it before continuing.
it: Il piano riscaldato si è raffreddato durante l'interruzione di corrente, un oggetto stampato potrebbe essersi staccato. Controllalo prima di continuare.

source: The loadcell configuration is incorrect.
it: La configurazione della cella di carico non è corretta.

source: There was a timeout while waiting for measurement sample, please repeat the action.
it: Si è verificato un timeout durante l'attesa del campione di misurazione, ripeti l'azione.

source: There was an error requesting the tare for loadcell.
it: Si è verificato un errore nella richiesta della tara per la cella di carico.

source: Tool %d
it: Strumento %d

source: Tool Light
it: Luce Strumento

source: Trigger Power Panic
it: Innesca Power Panic

source: UNEVEN BED
it: PIANO NON LIVELLATO

source: Unknown Error
it: Errore sconosciuto

source: VERSION INFO
it: INFO VERSIONE

source: Version Info
it: Info versione

source: %s Check hotend heater and control electronics for possible damage
it: %s Controllare che il riscaldatore dell'hotend e l'elettronica di controllo non siano danneggiati

source: Consumed material
it: Materiale consumato

source: Hi, this is your Prusa CORE One printer. I would like to guide you through the setup process.
it: Ciao, sono la tua stampante Prusa CORE One. Vorrei guidarti attraverso il processo di configurazione.

source: Wipe tower %dg
it: Torre di pulitura %dg

source: ABORT
it: INTERROMPI

source: Check all tools if they are properly parked or picked.
it: Controlla che tutti gli strumenti vengano parcheggiati o prelevati correttamente.

source: Maximum Chamber Temperature
it: Temperatura Massima Camera

source: Minimum Chamber Temperature
it: Temperatura Minima Camera

source: Nominal Chamber Temperature
it: Temperatura Nominale Camera

source: Preheating for unload
it: Scalda per scaricare

source: Printer Type
it: Tipo Stampante

source: Printer may vibrate and be noisier during homing.
it: La stampante potrebbe vibrare e risultare più rumorosa durante l'homing.

source: Shipping preparation Erasing configuration (but keeping Nextruder type) it will take some time...
it: Preparazione alla spedizione Cancellazione della configurazione (ma mantenendo il tipo di Nextruder) ci vorrà un po' di tempo...

source: Silent
it: Silenzioso

source: Sort Files
it: Ordina file

source: Sound Mode
it: Modo suono

source: Steel Sheets
it: Piastre d'acciaio

source: TUNE
it: REGOLA

source: This operation cannot be undone. Current configuration will be lost! Do you want to perform the Factory Shipping Preparation procedure?
it: Questa operazione non può essere annullata. La configurazione attuale andrà persa! Vuoi eseguire la procedura di preparazione alla spedizione in fabbrica?

source: This operation cannot be undone. Current configuration will be lost! You will need a USB drive with this firmware (%s_firmware_%s.bbf file) to start the printer again. Do you really want to continue?
it: Questa operazione non può essere annullata. La configurazione attuale andrà persa! Per riavviare la stampante è necessaria una chiavetta USB con questo firmware (file %s_firmware_%s.bbf). Vuoi davvero continuare?

source: This operation cannot be undone. Current user configuration and passwords will be lost! Do you want to reset the printer to factory defaults?
it: Questa operazione non può essere annullata. La configurazione utente corrente e le password andranno perse! Vuoi ripristinare le impostazioni di fabbrica della stampante?

source: Time
it: Data

source: Time Format
it: Formato Ora

source: Time Zone Minute Offset
it: Offset dei minuti del fuso orario

source: A filament specified in the G-code is either not loaded or wrong type.
it: Un filamento specificato nel G-Code non è caricato o è di tipo sbagliato.

source: ALL TOOLS
it: TUTTI GLI STRUMENTI

source: A movement command risks causing the model to collide with the ceiling.
it: Un comando di movimento rischia di far collidere il modello con il soffitto.

source: Address assignment error
it: Errore nell'assegnazione dell'indirizzo

source: BBF ALLOCATION FAILED
it: ALLOCAZIIONE BBF NON RIUSCITA

source: BBF INITIALIZATION FAILED
it: INIZIALIZZAZIONE BBF NON RIUSCITA

source: BBF initialization failed, repeat the action or try another USB drive.
it: Inizializzazione BBF non riuscita, ripeti l'azione o prova con una memoria USB diversa.

source: Bed leveling failed. Try again?
it: Livellamento del piano non riuscito. Riprovare?

source: CEILING CLEARANCE WARNING
it: AVVISO DI DISTANZA DAL SOFFITTO

source: CHAMBER MINTEMP ERROR
it: ERRORE MINTEMP CAMERA

source: CONNECT REGISTRATION FAILED
it: REGISTRAZIONE A CONNECT FALLITA

source: Emergency stop invoked by G-code (M112).
it: Arresto di emergenza richiesto da G-code (M112).

source: Ensure the top ventilation grille is closed for optimal chamber temperature.
it: Assicurati che la griglia di ventilazione superiore sia chiusa per una temperatura della camera ottimale.

source: CRASH DETECTED
it: RILEVATA COLLISIONE

source: CHAMBER WARMING UP
it: RISCALDAMENTO DELLA CAMERA

source: Chamber Cooling Fan Error
it: Errore Ventola di Raffreddamento Camera

source: Chamber Filtration Fan Error
it: Errore Ventola di Filtraggio Camera

source: Chamber cooling fan is not spinning. Check it for possible debris, then inspect the wiring.
it: La ventola di raffreddamento della camera non gira. Verificare la presenza di eventuali detriti, quindi ispezionare il cablaggio.

source: Chamber filtration fan is not spinning. Check it for possible debris, then inspect the wiring.
it: La ventola di filtraggio della camera non gira. Verificare la presenza di eventuali detriti, quindi ispezionare il cablaggio.

source: Changes of mapping available only in the Printer UI. Select Print to start the print with defaults.
it: Modifiche alla mappatura disponibili solo nell'interfaccia utente della stampante. Seleziona Stampa per avviare la stampa con le impostazioni predefinite.

source: Check the chamber thermistor wiring for possible damage.
it: Controllare che il cablaggio del termistore della camera non sia danneggiato.

source: Close Chamber Ventilation
it: Chiudi Ventilazione Camera

source: Cold Pull
it: Tiro a freddo

source: Dynamic allocation failed - out of memory. Reset the printer.
it: Allocazione dinamica fallita - memoria esaurita. Resettare la stampante.

source: ESP ERROR
it: ERRORE ESP

source: ESP NOT CONNECTED
it: ESP NON CONNESSO

source: ESP detected command error.
it: ESP ha rilevato un errore di comando.

source: ESP detected unknown error.
it: ESP ha rilevato un errore sconosciuto.

source: EXTRUDER NOT DETECTED
it: ESTRUSORE NON RILEVATO

source: Ensure the top ventilation grille is open for proper airflow.
it: Assicurati che la griglia di ventilazione superiore sia aperta per garantire un flusso d'aria adeguato.

source: Error erasing flash! Restart the printer and try again.
it: Errore nella cancellazione memoria! Riavvia la stampante e riprova.

source: FLASH ERASE ERROR
it: ERRORE CANCELLAZIONE FLASH

source: FW IN INTERNAL FLASH CORRUPTED
it: FW NELLA MEMORIA INTERNA CORROTTO

source: Failed to home the Y-axis, make sure there is no obstacle on Y-axis.
it: Homing non riuscito sull'asse Y. Assicurati che non ci siano ostacoli sull'asse Y.

source: Filament loading timed out.
it: Timeout caricamento filamento.

source: Filament not detected. Load filament now? Select NO to cancel the print. Select DISABLE FS to disable the filament sensor and continue print.
it: Filamento non rilevato. Caricarlo ora? Seleziona NO per annullare la stampa. Seleziona DISABILITA FS per disabilitare il sensore di filamento e continuare la stampa.

source: File error
it: Errore nel file

source: File system error! Try a different USB drive or format the drive with FAT32 filesystem (all data will be lost)!
it: Errore file system! Prova un'altra USB o formatta l'unità con filesystem FAT32 (tutti i dati andranno persi)!

source: Firmware and hardware versions do not match. Make sure you have the right firmware file for your printer.
it: Le versioni del firmware e dell'hardware non corrispondono. Assicurati di avere il file del firmware giusto per la tua stampante.

source: Firmware file missing in the USB flash!
it: File del firmware mancante su memoria USB!

source: Firmware file has invalid size! Check the file on the USB drive and try again.
it: File firmware di dimens. non valida! Controlla il file sulla memoria USB e riprova.

source: Firmware hash verification failed! Firmware file is damaged. Try downloading and copying it onto the USB drive again.
it: Verifica hash del firmware fallita! File del firmware danneggiato. Prova a scaricarlo e copiarlo nuovamente sulla memoria USB.

source: Firmware in the internal flash corrupted! Please reflash the firmware.
it: Firmware nella mem. interna corrotto! Esegui un nuovo flash del firmware.

source: Open Chamber Ventilation
it: Apri Ventilazione Camera

source: Firmware signature verification failed! Only official signed firmware can be flashed.
it: Verifica firma fw non riuscita! È possibile caricare solo firmware con firma ufficiale.

source: Firmware/printer types do not match. Make sure you have the right firmware file for your printer model.
it: Firmware/stampante non corrispondono. Assicurati di usare il fw corretto per la tua stampante.

source: Firmware/printer versions do not match! You are trying to flash FW meant for other revision of the Buddy board.
it: firmware/stampante non corrispondono! Questo firmware è per una versione diversa di scheda Buddy.

source: G-Code transfer running too slow. Check your network for issues or use different USB drive. Press Continue to resume printing.
it: Il trasferimento del G-code è troppo lento. Controlla che la rete non abbia problemi o utilizza un'altra unità USB. Premi Continua per riprendere la stampa.

source: Gcode Corruption
it: Gcode Corrotto

source: Gcode on the USB drive is corrupt. Fix manually before resuming.
it: Il Gcode dell'unità USB è corrotto. Correggilo manualmente prima di riprendere.

source: HAL detected an I2C busy state when receiving data via I2C.
it: HAL ha rilevato uno stato I2C occupato durante la ricezione di dati via I2C.

source: HAL detected an I2C busy state when sending data via I2C.
it: HAL ha rilevato uno stato I2C occupato durante l'invio di dati via I2C.

source: HAL detected an I2C error when receiving data via I2C.
it: HAL ha rilevato un errore I2C durante la ricezione di dati via I2C.

source: HAL detected an I2C error when sending data via I2C.
it: HAL ha rilevato un errore I2C durante l'invio di dati via I2C.

source: HAL detected an I2C timeout when receiving data via I2C.
it: HAL ha rilevato un timeout I2C durante la ricezione di dati via I2C.

source: HAL detected an I2C timeout when sending data via I2C.
it: HAL ha rilevato un timeout I2C durante l'invio di dati via I2C.

source: HAL detected an I2C undefined error when receiving data via I2C.
it: HAL ha rilevato un I2C indefinito durante la ricezione di dati via I2C.

source: HAL detected an I2C undefined error when sending data via I2C.
it: HAL ha rilevato un errore I2C indefinito durante l'invio di dati via I2C.

source: HOMING ERROR X
it: ERRORE HOMING X

source: HOMING ERROR Y
it: ERRORE HOMING Y

source: HOMING ERROR Z
it: ERRORE HOMING Z

source: Heatbreak thermistor is disconnected. Inspect the wiring.
it: Termistore Heatbreak disconnesso. Controllare il cablaggio.

source: Heating disabled due to 30 minutes of inactivity.
it: Riscaldamento disattivato dopo 30 minuti di inattività.

source: Hotend fan not spinning. Check it for possible debris, then inspect the wiring.
it: La ventola dell'hotend non gira. Verifica la presenza di eventuali detriti, quindi ispeziona il cablaggio.

source: I2C RECEIVE BUSY
it: RICEZIONE I2C OCCUPATA

source: I2C RECEIVE FAILED
it: RICEZIONE I2C NON RIUSCITA

source: I2C RECEIVE TIMEOUT
it: TIMEOUT RICEZIONE I2C

source: I2C RECEIVE UNDEFINED
it: RICEZIONE I2C NON DEFINITO

source: I2C SEND FAILED
it: INVIO I2C NON RIUSCITO

source: I2C SEND TIMEOUT
it: TIMEOUT INVIO I2C

source: I2C SEND UNDEFINED
it: INVIO I2C NON DEFINITO

source: INVALID FW SIZE ON USB FLASH DRIVE
it: DIMENSIONE FW NON VALIDA SU DRIVE USB

source: LOADCELL NOT CALIBRATED
it: CELLA DI CARICO NON CALIBRATA

source: LOADCELL TARE ERROR
it: ERRORE TARA CELLA DI CARICO

source: LOADCELL TARE FAILED
it: TARA CELLA DI CARICO FALLITA

source: LOADCELL TIMEOUT
it: TIMEOUT CELLA DI CARICO

source: Length of an axis is too long. Motor current is too low, probably. Retry check, pause or resume the print?
it: La lunghezza di un asse è eccessiva. Probabilmente la corrente del motore è troppo bassa. Riprovare il controllo, mettere in pausa o riprendere la stampa?

source: Length of an axis is too short. There's an obstacle or bearing issue. Retry check, pause or resume the print?
it: La lunghezza di un asse è troppo corta. C'è un ostacolo o un problema con il cuscinetto. Riprovare il controllo, mettere in pausa o riprendere la stampa?

source: Loadcell calibration is incomplete. Restart the printer and calibrate loadcell.
it: Calibrazione Cella di carico incompleta. Riavvia la stampante e calibra la Cella di carico.

source: Loadcell measured an inifinite or undefined load value.
it: La cella di carico ha misurato un valore di carico infinito o indefinito.

source: MCU in Buddy is overheated, likely due to exceeding the printer's operating temperature. Prevent overheating for optimal performance.
it: La MCU della Buddy è surriscaldata, probabilmente a causa del superamento della temperatura di esercizio della stampante. Evita il surriscaldamento per ottenere prestazioni ottimali.

source: MAINTENANCE WARNING CHANGES
it: MODIFICHE AGLI AVVISI DI MANUTENZIONE

source: MAINTENANCE WARNING FAILS
it: L'AVVISO DI MANUTENZIONE NON FUNZIONA

source: MMU OVERCURRENT
it: SOVRACORRENTE MMU

source: Measured temperature is not matching expected value. Check the thermistor is in contact with hotend. In case of damage, replace it.
it: La temperatura misurata non corrisponde al valore previsto. Controllare che il termistore sia a contatto con l'hotend. In caso di danni, sostituirlo.

source: Memory allocation failed for scheduled LED animation
it: Allocazione di memoria fallita per l'animazione LED programmata

source: No firmware found in the internal flash! Please flash firmware first!
it: Firmware non trovato nella mem. interna! Esegui un nuovo flash del firmware.

source: Nozzle High-flow
it: Ugello ad alto flusso

source: Nozzle Offset
it: Offset Ugello

source: Nozzle cleaning failed.
it: Pulizia ugello non riuscita.

source: OUT OF MEMORY
it: MEMORIA ESAURITA

source: Overcurrent detected on the connected USB device, disconnect it.
it: È stata rilevata una sovracorrente sul dispositivo USB collegato, scollegarlo.

source: PNG BUFFER FULL
it: BUFFER PNG PIENO

source: PRECISE HOMING REFINEMENT FAILED
it: PERFEZIONAMENTO DELL'HOMING PRECISO NON RIUSCITO

source: Pick Tool
it: Scegli Strumento

source: Please replace filament.
it: Sostituire il filamento.

source: Print fan not spinning. Check it for possible debris, then inspect the wiring.
it: La ventola di stampa non gira. Verifica la presenza di eventuali detriti, quindi ispeziona il cablaggio.

source: Printer has detected multiple consecutive filament loading errors. We recommend checking the extruder. Visit prusa.io/mmu-care.
it: La stampante ha rilevato più errori di caricamento del filamento consecutivi. Si consiglia di controllare l'estrusore. Visita prusa.io/mmu-care.

source: Puppy %s firmware fingerprint mismatch
it: Mancata corrispondenza del fingerprint del firmware Puppy %s

source: Puppy %s firmware not found
it: Firmware Puppy %s non trovato

source: Puppy %s flash writing failed
it: Scrittura flash Puppy %s non riuscita

source: Quick Pause
it: Pausa Rapida

source: Reading ESP firmware failed.
it: Lettura firmware ESP non riuscita.

source: Space allocation for firmware BBF file failed. Repeat the action or try another USB drive.
it: Allocazione dello spazio per il file BBF del firmware non riuscita. Ripeti l'azione o prova con un'altra unità USB.

source: Steppers disabled due to inactivity.
it: Motori disattivati per inattività.

source: TEMP NOT MATCHING
it: TEMP NON CORRISPONDE

source: Target temperature not yet reached. Continue waiting?
it: La temperatura target non è ancora stata raggiunta. Continuare ad aspettare?

source: This error code is not found in our database. Contact the support.
it: Questo codice di errore non è presente nel nostro database. Contatta l'assistenza.

source: UNKNOWN ERROR
it: Errore sconosciuto

source: UNSUPPORTED BUDDY FW
it: FW BUDDY NON SUPPORTATO

source: UNSUPPORTED FIRMWARE BBF FILE
it: FILE FIRMWARE BBF NON SUPPORTATO

source: UNSUPPORTED PRINTER MODEL
it: MODELLO DI STAMPANTE NON SUPPORTATO

source: USB DEVICE OVERCURRENT
it: SOVRACORRENTE DISP. USB

source: USB FLASH DRIVE NOT CONNECTED
it: FLASH DRIVE USB NON CONNESSO

source: USB PORT OVERCURRENT
it: SOVRACORRENTE PORTA USB
