Repository: prusa3d/Prusa-Firmware-Buddy
Catalog: src/lang/po/*/Prusa-Firmware-Buddy_*.po
Languages: it

source: USB drive or file error, the print is now paused. Reconnect the drive.
it: Errore nell'unità USB o nel file, la stampa è in pausa. Ricollega l'unità.

source: USB flash drive contains unsupported firmware BBF file.
it: L'unità USB contiene un file BBF del firmware non supportato.

source: Unable to home the printer. Do you want to try again?
it: Homing non riuscito. Vuoi riprovare?

source: Unable to verify the extruder type, check the wiring and connectors.
it: Non è stato possibile verificare il tipo di estrusore, controlla il cablaggio e i connettori.

source: Unknown file system
it: File system sconosciuto

source: Use a different USB drive or reformat this one to the supported FAT32 file system.
it: Utilizzare un'altra unità USB o riformattare questa unità con il file system FAT32 supportato.

source: Waiting for the user. Press "Resume" once the printer is ready.
it: In attesa dell'utente. Premi "Riprendi" quando la stampante è pronta.

source: Warning
it: Attenzione

source: Welcome to the Cold Pull wizard. Prepare a 30cm piece of PLA filament and follow the instructions. For more details, visit:
it: Benvenuto nella procedura guidata di Tiro a freddo. Prepara un pezzo di filamento PLA di circa 30 cm e segui le istruzioni. Per maggiori dettagli visita:

source: Fan Compabibility
it: Compatibilità Ventola

source: MK3 Compatibility
it: Compatibilità MK3

source: Printer type changed from %s to %s. Factory reset has to be performed.
it: Tipo di stampante cambiato da %s a %s. È necessario eseguire un reset di fabbrica.

source: With sock
it: Con calzino
