Repository: prusa3d/Prusa-Firmware-Buddy
Catalog: src/lang/po/*/Prusa-Firmware-Buddy_*.po
Languages: it

source: This will change the behavior of the filament sensor. Do you want to continue?
it: Questo cambierà il comportamento del sensore di filamento. Vuoi continuare?

source: Thr
it: Gi

source: Dwarf Board Temp
it: Temp scheda Dwarf

source: This change will apply to all toolheads. Do you want to continue?
it: Questa modifica sarà applicata a tutte le testine. Vuoi continuare?

source: This feature allows you to gather diagnostic data to show in Grafana. Be careful, it can send unencrypted data to the internet.
it: Questa funzione consente di raccogliere dati diagnostici da mostrare in Grafana. Attenzione, può inviare dati non criptati su Internet.

source: To calibrate with currently loaded filament, press NEXT. To change filament, press UNLOAD.
it: Per calibrare con il filamento attualmente caricato, premere AVANTI. Per cambiare filamento, premere SCARICA.

source: To calibrate with currently loaded filament, press NEXT. To load filament, press LOAD. To change filament, press UNLOAD.
it: Per calibrare con il filamento attualmente caricato, premere AVANTI. Per caricare il filamento, premere CARICA. Per cambiare filamento, premere SCARICA.

source: To setup or troubleshoot your Wi-Fi, please visit:
it: Per configurare o risolvere i problemi del Wi-Fi, consulta:

source: Today at
it: Oggi alle

source: Tool 1 Filament Sensor Calibration
it: Calibrazione Sensore Fil. Strumento 1

source: Tool 1 Loadcell Test
it: Test Cella di carico Strumento 1

source: Tool 2 Filament Sensor Calibration
it: Calibrazione Sensore Fil. Strumento 2

source: Dwarf MCU Temp
it: Temp MCU Dwarf

source: Tool 2 Loadcell Test
it: Test Cella di carico Strumento 2

source: Tool 3 Filament Sensor Calibration
it: Calibrazione Sensore Fil. Strumento 3

source: Tool 3 Loadcell Test
it: Test Cella di carico Strumento 3

source: Tool 4 Filament Sensor Calibration
it: Calibrazione Sensore Fil. Strumento 4

source: Tool %u Filament
it: Filamento Strumento %u

source: Tool 4 Loadcell Test
it: Test Cella di carico Strumento 4

source: Tool 5 Filament Sensor Calibration
it: Calibrazione Sensore Fil. Strumento 5

source: Tool 5 Loadcell Test
it: Test Cella di carico Strumento 5

source: Tools
it: Strumenti

source: Door Sensor
it: Sensore sportello

source: ERR HW test failed
it: ERR HW test non riuscito

source: Enclosure fan
it: Ventola enclosure

source: Fan RPM tests
it: Test RPM Ventola

source: Filament detected. Unload filament now? Select NO to start the print with the currently loaded filament.
it: Rilevato filamento. Scaricare subito il filamento? Seleziona NO per avviare la stampa con il filamento attualmente caricato.

source: Filament is not customizable
it: Il filamento non è personalizzabile

source: Total Load Fails
it: Totale caricamenti non riusciti

source: Tue
it: Ma

source: Turn the knob to move Heatbed
it: Ruota la manopola per spostare il piano

source: Cooldown
it: Raffredda

source: Center N and Fewer Items
it: Centra N e meno elementi

source: Change Filament in All Tools
it: Cambia filamento in tutti gli strumenti

source: ERR Help filament
it: ERR Aiuto filamento

source: ERR Wait for User
it: ERR Attendere utente

source: For Filament Change, Preheat
it: Per il cambio filamento, riscalda

source: FOOTER
it: PIÈ DI PAGINA

source: FOOTER ADVANCED
it: AVANZATE PIÈ DI PAGINA

source: Firmly attach the accelerometer to the extruder (remove silicone sock if necessary). In the next step, extruder will start moving and calibration data will be collected.
it: Fissare saldamente l'accelerometro all'estrusore (se necessario, rimuovere il calzino in silicone). Nella fase successiva, l'estrusore inizierà a muoversi e verranno raccolti i dati di calibrazione.

source: Feeding to FSensor
it: Alim. in FSensor

source: Feeding to extruder
it: Alim. in estrusore

source: Firmly attach the accelerometer to the heatbed. In the next step, heatbed will start moving and calibration data will be collected.
it: Fissare saldamente l'accelerometro al piano riscaldato. Nella fase successiva, il piano riscaldato inizierà a muoversi e verranno raccolti i dati di calibrazione.

source: Unassigned G-Code filament(s)
it: Filamento(i) G-code non assegnato(i)

source: Unknown
it: Sconosciuto

source: Unknown file error
it: Errore file sconosciuto

source: Checking for switched fans
it: Controllo ventole invertite

source: Unload filament
it: Scarica filamento

source: User Interface
it: Interfaccia utente

source: Warn
it: Avvisa

source: Install sheet on heatbed.
it: Installa la piastra sul piano riscaldato.

source: Visible
it: Visibile

source: Wed
it: Me

source: What is this?
it: Cos'è questo?

source: What nozzle diameter do I have?
it: Che diametro di ugello ho?

source: Language
it: Lingua

source: Wi-Fi credentials loaded via NFC. Apply credentials? SSID: %s
it: Credenziali Wi-Fi caricate tramite NFC. Applicare le credenziali? SSID: %s

source: X-axis steps per unit
it: Step per unità asse X

source: You can now fully use all network features of the printer.
it: Ora puoi utilizzare tutte le funzioni di rete della stampante.

source: You're already successfully connected through the ethernet cable. Switch to Wi-Fi and continue?
it: Sei già correttamente connesso attraverso il cavo Ethernet. Passare al Wi-Fi e continuare?

source: Y current (0 default)
it: Corrente Y (0 default)

source: Y-axis direction
it: Direzione asse Y

source: Y-axis steps per unit
it: Step per unità asse Y

source: Nozzle have to be perfectly clean for good calibration results. - Clean all nozzles - Clean parking plate - Press continue when done
it: Gli ugelli devono essere perfettamente puliti per ottenere buoni risultati di calibrazione. - Pulisci tutti gli ugelli - Pulisci la piastra di parcheggio - Premi continua quando hai finito

source: Z-axis length
it: Lunghezza asse Z

source: times
it: volte

source: Z-axis steps per unit
it: Step per unità asse Z

source: Once the printer starts extruding plastic, adjust the nozzle height by turning the knob until the filament sticks to the print sheet.
it: Appena la stampante inizia ad estrudere plastica, regola l'altezza ugello ruotando la manopola finché il filamento non si attacchi alla superficie di stampa.

source: Preheating for load
it: Scalda per caricare

source: Preheating for purge
it: Scalda per pulitura

source: Please make sure there is no filament in the tool and side filament sensors. You will need filament to finish this test later.
it: Assicurati che non ci sia filamento nello strumento e nei sensori di filamento laterali. In seguito ti servirà del filamento per completare questo test.

source: Please wait until a tool is picked
it: Attendi che venga scelto uno strumento

source: Preparing for calibration pin installation.
it: Preparazione per l'installazione del perno di calibrazione.

source: Purge Filament
it: Spurgo filamento

source: Print will end
it: La stampa terminerà

source: PrintFan RPM
it: RPM ventola di stampa

source: Rename
it: Rinomina

source: Disengaging idler
it: Sgancio idler

source: Do you really want to restore default input shaper configuration?
it: Vuoi davvero ripristinare la configurazione predefinita di Input shaper?

source: Retract from FINDA
it: Retrai da FINDA

source: Selecting fil. slot
it: Seleziono slot fil.

source: Dock 4 Calibration
it: Calibrazione Dock 4

source: Dock 5 Calibration
it: Calibrazione Dock 5

source: Temp. style
it: Stile temp.

source: The calibration should take a little over 14 minutes.
it: La calibrazione dovrebbe durare poco più di 14 minuti.

source: The calibration should take a little over 7 minutes.
it: La calibrazione dovrebbe durare poco più di 7 minuti.

source: The first layer calibration failed to finish. Double-check the printer's wiring, nozzle and axes, then restart the calibration.
it: Calib. primo layer non riuscita. Ricontrolla il cablaggio, assi e ugello, quindi ripeti la calibrazione.

source: Tool Offsets Calibration
it: Calibrazione Offset Strumenti

source: Ejecting
it: Espulsione

source: Ejecting filament
it: Espellendo filamento

source: We need to start without the filament in the extruder. Please make sure there is no filament in the filament sensor.
it: Dobbiamo iniziare senza il filamento nell'estrusore. Assicurati che non ci sia del filamento nel sensore di filamento.

source: We will need your help with this calibration. You will be asked to screw in a calibration pin.
it: Abbiamo bisogno del tuo aiuto per questa calibrazione. Ti verrà chiesto di avvitare un perno di calibrazione.

source: Z AXIS MOVE
it: SPOSTA ASSE Z

source: Z height:
it: Altezza Z:

source: in progress
it: in corso

source: Please select a filament.
it: Seleziona un filamento.

source: - Remove calibration pin. - Install sheet on heatbed.
it: - Rimuovi il perno di calibrazione. - Posiziona la piastra di stampa.

source: - Remove heatbed sheet. - Install calibration pin.
it: - Rimuovi la piastra di stampa. - Inserisci il perno di calibrazione.

source: 1. Please park current tool manually. Move the tool changing mechanism to the rear and align it with pins
it: 1. Parcheggia manualmente lo strumento attuale. Sposta il meccanismo di cambio strumento sul retro e allinealo con i pin

source: 2. Now move the tool changing mechanism to the right, the tool will be locked in the dock
it: 2. Adesso sposta il meccanismo a destra, lo strumento verrà bloccato nel dock

source: 3. The tool changing mechanism can now move freely. Move it a little bit to the front.
it: 3. Adesso il meccanismo di cambio strumento può muoversi liberamente. Spostalo verso la parte anteriore.

source: Before you proceed, make sure filament is unloaded from the Nextruder.
it: Prima di procedere, assicurati che il filamento sia stato scaricato dal Nextruder.

source: Calibrating tool offsets.
it: Calibrazione offset strumenti

source: Close the idler door and secure it with the swivel. The calibration is done!
it: Chiudi lo sportello idler e bloccalo con con la clip di chiusura. La calibrazione è completa!

source: Gearbox alignment
it: Allineamento della scatola degli ingranaggi

source: Gearbox alignment in progress, please wait (approx. 20 seconds)
it: Allineamento degli ingranaggi in corso, attendere (circa 20 secondi)

source: Heat Entire Bed
it: Riscalda l'intero piano.

source: FIRST LAYER CALIBRATION
it: CALIBRAZIONE PRIMO LAYER

source: Moving away.
it: Spostamento.

source: PROJECTS
it: PROGETTI

source: Rotate each screw counter-clockwise by 1.5 turns. The screw heads should be flush with the cover. Unlock and open the idler.
it: Ruota ogni vite in senso antiorario di 1,5 giri. Le teste delle viti devono essere a filo del coperchio. Sblocca e apri l'idler.

source: The gearbox calibration is only necessary for user-assembled or serviced gearboxes. In all other cases, you can skip this step.
it: La calibrazione degli ingranaggi è necessaria solo per le scatole degli ingranaggi montate dall'utente o sottoposte a manutenzione. In tutti gli altri casi, puoi saltare questo passaggio.

source: Tighten the M3 screws firmly in the correct order, they should be slightly below the surface. Do not over-tighten.
it: Stringi saldamente le viti M3 nell'ordine corretto, devono essere leggermente al di sotto della superficie. Non serrare in modo eccessivo.

source: Waiting for hotends to stabilize at calibration temperature:
it: In attesa che la temperatura degli hotend si stabilizzi a quella di calibrazione:

source: We need to start without the filament in the extruder. Please unload it.
it: Dobbiamo iniziare senza il filamento nell'estrusore. Per favore, scaricalo.

source: %d Dock Position Calibration
it: %d Calibrazione posizione Dock

source: Assigned tool(s) without filament
it: Strumento/i assegnato/i senza filamento

source: Based on the test it looks like the fans connectors are switched. Double check your wiring and repeat the test.
it: In base al test, sembra che i connettori delle ventole siano invertiti. Ricontrolla il cablaggio e ripeti il test.

source: Bed
it: Piano

source: Calibrating, do not remove filament.
it: Calibrazione, non rimuovere il filamento.

source: Calibration data saved successfully
it: Dati di calibrazione salvati correttamente

source: Checking axes
it: Controllo assi

source: Cold Pull successfully completed
it: Tiro a freddo completato correttamente

source: Heater Voltage
it: Voltaggio Riscaldatore

source: EJECT FROM MMU
it: ESPELLI DA MMU

source: ETHERNET SETTINGS
it: IMPOSTAZIONI ETHERNET

source: FILAMENT CHANGE
it: CAMBIO FILAMENTO

source: FILAMENT MAPPING
it: MAPPING FILAMENTO

source: FSensor side
it: FSensor laterale

source: Filament inserted, press continue.
it: Filamento inserito, premi continua.

source: Filament sensor calibrated.
it: Sensore filamento calibrato.

source: Filament sensor calibration
it: Calibrazione sensore filamento

source: Filament sensors calibrated.
it: Sensori filamento calibrati.

source: Filament sensors calibration
it: Calibrazione sensori filamento

source: Front Side
it: Lato Anteriore

source: Front Side [um]
it: Lato Anteriore [um]

source: COMMUNICATION ERROR
it: ERRORE DI COMUNICAZIONE

source: Bed heater selftest failed. If you forgot to put the steel sheet on the heatbed, place it on and press Retry.
it: L'autotest del piano riscaldato non è riuscito. Se hai dimenticato di posizionare la piastra di acciaio sul piano riscaldato, posizionala e premi Riprova.

source: Calibration pin has not been reached. Please check the pin installation.
it: Il perno di calibrazione non è stato raggiunto. Controlla l'installazione del perno.

source: Hotend fan (test disabled)
it: Ventola Hotend (test disabilitato)

source: HW test cleanup
it: HW test pulizia

source: Heating up the nozzle
it: Riscaldamento ugello

source: Hi, this is your Original Prusa XL printer. I would like to guide you through the setup process.
it: Ciao, sono la tua stampante Original Prusa XL. Ti guiderò nel processo di configurazione.

source: Hi, this is your Original Prusa iX printer. I would like to guide you through the setup process.
it: Ciao, sono la tua stampante Original Prusa iX. Ti guiderò nel processo di configurazione.

source: High
it: Alto

source: Cannot perform the action, filament is already loaded. Unload it first.
it: Impossibile eseguire l'azione, il filamento è già caricato. Scaricarlo prima.

source: Change Filament
it: Cambio filamento

source: Information
it: Informazioni

source: Input Current
it: Corrente in ingresso

source: Check the thermistor wiring for potential damage.
it: Controlla che il cablaggio del termistore non sia danneggiato.

source: Increasing distance to bed
it: Distanziamento dal piano

source: Credentials from INI
it: Credenziali da INI

source: Insert the filament into the extruder until the sensor detects the filament.
it: Inserisci il filamento nell'estrusore fino a quando il sensore lo rileva.

source: Insert the filament through the side filament sensor into the extruder until the tool filament sensor detects the filament.
it: Inserisci il filamento nell'estrusore attraverso il sensore di filamento laterale fino a quando il sensore dello strumento non rileva il filamento.

source: Is Hotend fan (left) spinning?
it: La ventola Hotend (a sinistra) gira?

source: Is filament in the filament sensor?
it: Il filamento è nel sensore del filamento?

source: Is there any filament in the tool or side filament sensors?
it: C'è del filamento nello strumento o nei sensori di filamento laterali?

source: Item %i
it: Elemento %i

source: Left Side
it: Lato Sinistro

source: Credentials via NFC
it: Credenziali via NFC

source: Delete INI file
it: Elimina il file INI

source: Delete credentials INI file? (Recommended)
it: Cancellare il file INI delle credenziali? (Consigliato)

source: Disable Motors
it: Disabilita motori

source: Dock %d position differs too much from expected values.
it: La posizione del Dock %d si discosta troppo dai valori previsti.

source: Dwarf board %d fault: %s
it: Guasto scheda Dwarf %d: %s

source: LOADCELL BAD CONFIGURATION
it: CONFIGURAZIONE ERRATA CELLA DI CARICO

source: Left Side [um]
it: Lato Sinistro [um]

source: METRICS & LOG
it: METRICHE E REGISTRO

source: MMU filament sensor calibration
it: Calibrazione del sensore del filamento MMU

source: Mismatching filament types
it: Tipo di filamenti non corrispondenti

source: Last Print Crashes on Y Axis
it: Collisioni su asse Y ultima stampa

source: ODOMETER
it: ODOMETRO

source: On Restart
it: In ripresa

source: Load
it: Carica

source: Printing time
it: Tempo di stampa

source: Print fan
it: Ventola di stampa

source: Print ended
it: Stampa terminata

source: Print started
it: Stampa iniziata

source: QUEUE FULL
it: CODA PIENA

source: Loosen by %.1f turns
it: Allentare di %.1f giri

source: Rear Side
it: Lato Posteriore

source: Rear Side [um]
it: Lato Posteriore [um]

source: Remaining time
it: Tempo rimanente

source: Remove filament to finish.
it: Rimuovi il filamento per completare.

source: Right Side
it: Lato Destro

source: Right Side [um]
it: Lato Destro [um]

source: SELECTOR CANNOT HOME
it: SELETTORE ERR MOVIM

source: MCU Temperature
it: Temperatura MCU

source: Enter credentials manually
it: Inserisci le credenziali manualmente

source: Failed to home the X-axis, make sure there is no obstacle on X-axis or Y-axis.
it: Homing non riuscito sull'asse Y. Assicurati che non ci siano ostacoli sull'asse X o Y.

source: Failed to home the Y-axis, make sure there is no obstacle on X-axis or Y-axis.
it: Homing non riuscito sull'asse Y. Assicurati che non ci siano ostacoli sull'asse X o Y.

source: Failed to home the Z-axis, make sure the loadcell is working.
it: Homing asse Z non riuscito, assicurati che la cella di carico sia funzionante.

source: Test FAILED!
it: Test FALLITO!

source: MMU Error
it: Errore MMU

source: MMU Current
it: Corrente MMU

source: Backup Calibration to USB
it: Backup Calibrazione su USB

source: Try checking belt tension, decreasing sensitivity in the tune menu or recalibrating dock position.
it: Prova a controllare la tensione della cinghia, a diminuire la sensibilità nel menu di regolazione o ricalibrare la posizione del dock.

source: ERROR
it: ERRORE

source: USER INTERFACE
it: INTERFACCIA UTENTE

source: FINISH remaining calibrations without proceeding to other tests, or perform ALL Calibrations and Tests? If you QUIT, all data up to this point is saved.
it: FINIRE le calibrazioni rimanenti senza procedere ad altri test, oppure eseguire TUTTE le calibrazioni e i test? Se ESCI, tutti i dati fino a questo punto vengono salvati.

source: MOVE AXIS
it: SPOSTA ASSE

source: axis
it: asse

source: G-Code Level
it: Livello G-code

source: TEMPERATURE
it: TEMPERATURA

source: Wizard
it: Configurazione guidata

source: INSPECT FINDA
it: CONTROLLA FINDA

source: LOAD TO EXTR. FAILED
it: CARICAM. A ESTRUSORE FALLITO

source: Link is valid only if you are connected to the same network as the printer.
it: Il collegamento è valido solo se sei connesso alla stessa rete della stampante.

source: Load config from file
it: Carica configurazione da file

source: MMU SELFTEST FAILED
it: AUTOTEST MMU FALLITO

source: MMU not responding correctly. Check the wiring and connectors.
it: La MMU non risponde correttamente. Controlla il cablaggio e i connettori.

source: MMU not responding. Check the wiring and connectors.
it: La MMU non risponde. Controlla il cablaggio e i connettori.

source: MMU selftest failed on the Idler TMC driver. Check the wiring and connectors. If the issue persists contact support.
it: Autotest MMU non riuscito sul driver TMC dell'Idler. Controlla il cablaggio e i connettori. Se il problema persiste, contatta l'assistenza.

source: MMU selftest failed on the Pulley TMC driver. Check the wiring and connectors. If the issue persists contact support.
it: Autotest MMU non riuscito sul driver TMC della Puleggia. Controlla il cablaggio e i connettori. Se il problema persiste, contatta l'assistenza.

source: MMU selftest failed on the Selector TMC driver. Check the wiring and connectors. If the issue persists contact support.
it: Autotest MMU non riuscito sul driver TMC del Selettore. Controlla il cablaggio e i connettori. Se il problema persiste, contatta l'assistenza.

source: No network interface
it: Nessuna interfaccia di rete

source: Not enough current for the Pulley TMC driver. There is probably an issue with the electronics. Check the wiring and connectors.
it: Corrente insufficiente per il driver TMC della Puleggia. È probabile che ci sia un problema con l'elettronica. Controlla il cablaggio e i connettori.

source: Not enough current for the Selector TMC driver. There is probably an issue with the electronics. Check the wiring and connectors.
it: Corrente insufficiente per il driver TMC del Selettore. È probabile che ci sia un problema con l'elettronica. Controlla il cablaggio e i connettori.

source: Overcurrent detected on heatbed port, disconnect the device.
it: Rilevata sovracorrente sulla porta del piano riscaldato, scollega il dispositivo.

source: PRINTER SETUP
it: IMPOSTAZIONE STAMPANTE

source: PULLEY CANNOT MOVE
it: PULEGGIA BLOCCATA

source: Please insert a flash drive with a network configuration file. The configuration file can be generated in PrusaSlicer.
it: Inserisci una chiavetta con un file di configurazione della rete. Il file di configurazione può essere generato in PrusaSlicer.

source: Probed XY position is %.3f mm from expected. This is more than allowed difference of %.3f mm.
it: La posizione XY rilevata è di %.3f mm rispetto a quella prevista. Si tratta di una differenza superiore a quella consentita di %.3f mm.

source: Pulley motor stalled. Ensure the pulley can move and check the wiring.
it: Il motore della puleggia è bloccato. Verifica che la puleggia possa muoversi e controlla il cablaggio.

source: Name must contain only 'A-Z0-9_-' characters
it: Il nome deve contenere solo caratteri 'A-Z0-9_-'

source: Name must not be '---'
it: Il nome non deve essere '---'

source: Name must not be empty
it: Il nome non deve essere vuoto

source: Nozzle 3 Temperature
it: Temperatura Ugello 3

source: Nozzle 4 Temperature
it: Temperatura Ugello 4

source: Nozzle 5 Temperature
it: Temperatura Ugello 5

source: QR Code
it: Codice QR

source: Remove the ejected filament from the front of the MMU. Tip: Filament is automatically ejected when the end of the spool is reached.
it: Rimuovere il filamento espulso dalla parte anteriore dell'MMU. Suggerimento: Il filamento viene espulso automaticamente quando si raggiunge la fine della bobina.

source: Requested filament tool is not available on this hardware. Check the G-code for tool index out of range (T0-T4).
it: Strumento filamento richiesto non disponibile su questo hardware. Controllare l'indice strumento nel G-code (T0-T4).

source: Parking test
it: Test parcheggio

source: SELECTOR CANNOT MOVE
it: SELETTORE BLOCCATO

source: STUCK FILAMENT DETECTED
it: RILEVATO FILAMENTO BLOCCATO

source: Short circuit on the Idler TMC driver. Check the wiring and connectors. If the issue persists contact support.
it: Cortocircuito sul driver TMC Idler. Controlla il cablaggio e i connettori. Se il problema persiste, contatta l'assistenza.

source: Short circuit on the Pulley TMC driver. Check the wiring and connectors. If the issue persists contact support.
it: Cortocircuito sul driver TMC della Puleggia. Controlla il cablaggio e i connettori. Se il problema persiste, contatta l'assistenza.

source: Short circuit on the Selector TMC driver. Check the wiring and connectors. If the issue persists contact support.
it: Cortocircuito sul driver TMC del Selettore. Controlla il cablaggio e i connettori. Se il problema persiste, contatta l'assistenza.

source: Switch to Wi-Fi
it: Passa a Wi-Fi

source: Successfully connected to:
it: Connesso correttamente a:
