Repository: prusa3d/Prusa-Firmware-Buddy
Catalog: src/lang/po/*/Prusa-Firmware-Buddy_*.po
Languages: it

source: Side Filament Sensor can be remapped to the right side. (calibration will follow) Remap?
it: Il Sensore di Filamento laterale può essere rimappato sul lato destro. (seguirà la calibrazione) Rimappare?

source: Side Filament Sensors can be remapped to the right side. (calibration will follow) Remap?
it: I Sensori di Filamento laterali possono essere rimappati sul lato destro. (seguirà la calibrazione) Rimappare?

source: Third Side Filament Sensor can be remapped to the right side. (calibration will follow) Remap?
it: Il Terzo Sensore di Filamento laterale può essere rimappato sul lato destro. (seguirà la calibrazione) Rimappare?

source: %d First Layer Calibration
it: %d Calibrazione primo layer

source: %d Heater Test
it: %d Test riscaldatore

source: %d Tool Offset Calibration
it: %d Calibrazione Offset Strumento

source: %d XY Axis Test
it: %d Test asse XY

source: (User)
it: (Utente)

source: %u %% / stopped
it: %u %% / arrestato

source: %u %% / stuck
it: %u %% / bloccato

source: 1. Open Prusa app on your mobile device. 2. Go to in-app Menu and select "Set up Printer Wi-Fi." 3. Follow on-screen instructions.
it: 1. Apri l'app Prusa sul tuo dispositivo mobile. 2. Vai al menu in-app e seleziona "Imposta il Wi-Fi della stampante". 3. Segui le istruzioni sullo schermo.

source: 1. Scan the QR code using the Prusa app or camera, or visit prusa.io/add 2. Log in
it: 1. Scansiona il codice QR utilizzando l'app Prusa o la fotocamera, oppure visita prusa.io/add 2. Accedi

source: Advanced
it: Avanzate

source: Align the tool changing mechanism with the tool and lock it by sliding both metal bars to the right.
it: Allinea il meccanismo di cambio strumento con lo strumento e bloccalo facendo scorrere entrambe le barre metalliche verso destra.

source: Approx. %d min
it: Circa %d min

source: BACK
it: INDIETRO

source: Attempt %d/%d
it: Tentativo %d/%d

source: Before you continue, make sure that PLA filament is loaded.
it: Prima di continuare, assicurati che sia caricato un filamento di PLA.

source: Before you continue, make sure PLA filament is loaded directly into the extruder.
it: Prima di continuare, assicurati che il filamento PLA sia caricato direttamente nell'estrusore.

source: Before you continue, unload the filament. Then press down the blue part on the fitting and pull the PTFE tube from the tool head.
it: Prima di continuare, scarica il filamento. Poi premi la parte blu del raccordo ed estrai il tubo in PTFE dalla testa dello strumento.

source: CHECKS
it: CONTROLLI

source: COLD PULL
it: TIRO A FREDDO

source: CALIBRATIONS & TESTS
it: CALIBRAZIONI & TEST

source: CONTROL
it: CONTROLLO

source: Calibrate Filament Sensor
it: Calibra Sensore Filamento

source: Calibrating X motor
it: Calibrazione motore X

source: Calibrating Y motor
it: Calibrazione motore Y

source: Calibrating accelerometer...
it: Calibrazione accelerometro...

source: Calibration data restored successfully
it: Dati di calibrazione ripristinati correttamente

source: Calibration failed with error.
it: Calibrazione non riuscita con errore.

source: CUSTOM PARAMETERS
it: PARAMETRI PERSONALIZZATI

source: Calibrate Filament Sensors
it: Calibra sensori di filamento

source: Can't enable MMU: calibrate and enable the printer's filament sensor first.
it: Impossibile abilitare la MMU: prima calibra e abilita il sensore di filamento della stampante.

source: Carry Out the Changes
it: Applica le modifiche

source: Cold Pull successfully completed. Insert PTFE tube back in the fitting. You can continue printing. If the issue persists, repeat this procedure again.
it: Tiro a freddo completato correttamente. Inserisci nuovamente il tubo PTFE nel raccordo. Puoi continuare a stampare. Se il problema persiste, ripeti questa procedura.

source: Code: %s
it: Codice: %s

source: Connecting to:
it: Connessione a:

source: Consider adjusting belt tension.
it: Valuta se è il caso di regolare la tensione della cinghia.

source: Control
it: Controllo

source: Cooling the nozzle
it: Raffreddamento dell'ugello

source: Custom
it: Personalizzato

source: Detected mismatching loaded filament types, this could ruin the print. Print anyway?
it: Rilevato un abbinamento errato dei tipi di filamento caricati, che potrebbe rovinare la stampa. Stampare comunque?

source: Detected mismatching nozzle diameters, this could ruin the print. Print anyway?
it: Rilevato un abbinamento errato dei diametri degli ugelli, che potrebbe rovinare la stampa. Stampare comunque?

source: Do you want to add your printer to Prusa Connect?
it: Vuoi aggiungere la tua stampante a Prusa Connect?

source: DOCK CONFIGURATION
it: CONFIGURAZIONE DOCK

source: Do you really want to restore default filament ordering?
it: Vuoi davvero ripristinare l'ordine predefinito dei filamenti?

source: Do you want to connect to the Wi-Fi with the Prusa app on your phone using NFC?
it: Vuoi connetterti al Wi-Fi con l'app Prusa sul tuo telefono utilizzando l'NFC?

source: Dock %d calibration
it: Calibrazione Dock %d

source: Dock 1 Calibration
it: Calibrazione Dock 1

source: Dock 2 Calibration
it: Calibrazione Dock 2

source: Dock 3 Calibration
it: Calibrazione Dock 3

source: Dock Calibration
it: Calibrazione Dock

source: Don't touch the extruder.
it: Non toccare l'estrusore.

source: Done
it: Fatto

source: Do you want to save changes and reboot the printer?
it: Vuoi salvare le modifiche e riavviare la stampante?

source: ENCLOSURE SETTINGS
it: IMPOSTAZIONI ENCLOSURE

source: Dynamic
it: Dinamico

source: EXPERIMENTAL SETTINGS
it: IMPOSTAZIONI SPERIMENTALI

source: Eject From MMU
it: Espelli da MMU

source: End of test
it: Fine del test

source: Edit Filaments
it: Modifica Filamenti

source: Enable Filaments
it: Abilita Filamenti

source: Enable Metrics
it: Abilita Misurazioni

source: Experimental Settings
it: Impostazioni sperimentali

source: FILAMENT
it: FILAMENTO

source: FILAMENT REMOVED
it: FILAMENTO RIMOSSO

source: FINISH
it: COMPLETA

source: Extruder current
it: Corrente Estrusore

source: Extruder direction
it: Direzione estrusore

source: Extruder steps per unit
it: Step per unità Estrusore

source: FILAMENT DETAIL
it: DETTAGLI FILAMENTO

source: FILAMENT MANAGEMENT
it: GESTIONE FILAMENTO

source: FILAMENTS VISIBILITY
it: VISIBILITÀ FILAMENTI

source: Failed to open file
it: Apertura file non riuscita

source: Failed to restore calibration data
it: Impossibile ripristinare i dati di calibrazione

source: Failed to save calibration data
it: Impossibile salvare i dati di calibrazione

source: Features required:
it: Caratteristiche richieste:

source: Filament Sensing
it: Rilevamento del filamento

source: Filament check
it: Controllo filamento

source: Fan speeds will be adjusted
it: La velocità della ventola verrà regolata

source: Filament %u
it: Filamento %u

source: Filament '%s' is abrasive, but you don't have a hardened nozzle installed. Do you really want to continue?
it: Il filamento '%s' è abrasivo, ma non hai installato un ugello temprato. Vuoi davvero continuare?

source: Filament Sensors Tuning
it: Regolazione Sensori di Filamento

source: Filament sensors
it: Sensori di filamento

source: File corrupt
it: File corrotto

source: File doesn't contain any print instructions
it: Il file non contiene istruzioni di stampa

source: File transfer error
it: Errore nel trasferimento file

source: Firmware Version
it: Vers. firmware

source: Filament with this name already exists
it: Un filamento con questo nome esiste già

source: First Layer Calibration
it: Calibrazione primo layer

source: Flashing err
it: Err. flashing

source: Footer
it: Piè di pagina

source: Fri
it: Ve

source: G-Code Checks
it: Controlli G-code

source: G-Code filaments
it: Filamenti G-code

source: G-code version doesn't match
it: Versione G-code non corrisponde

source: Following features are required:
it: Sono richieste le seguenti caratteristiche:

source: Gone
it: Andato

source: HEATUP
it: RISCALDA

source: HELP
it: AIUTO

source: HW Reset
it: Reset HW

source: Happy printing!
it: Buona stampa!

source: Heatbed heater check
it: Contr. risc. Piano

source: Heatbreak Temp
it: Temperatura Heatbreak

source: Heatbreak status
it: Stato Heatbreak

source: Heater testing
it: Test riscald.

source: Help
it: Aiuto

source: Hotend Type
it: Tipo di Hotend

source: INPUT SHAPER CALIBRATION
it: CALIBRAZIONE INPUT SHAPER

source: In the next step, use the knob to adjust the nozzle height. Check the pictures in the handbook for reference.
it: Nel prossimo passo, usa la manopola per regolare l'altezza ugello. Controlla le immagini sul manuale per rifer.

source: Insert the drive into the printer and turn it on or restart it. Confirm the installation.
it: Inserisci la chiavetta nella stampante e accendila o riavviala. Conferma l'installazione.

source: Install and tighten the dock pins. Be careful in next step the printer will be moving.
it: Installa e stringi i perni del dock. Fai attenzione al prossimo passo, la stampante si muoverà.

source: Install pins
it: Installa i perni

source: Is Abrasive
it: È Abrasivo

source: Language & Time
it: Lingua & Ora

source: Leave
it: Abbandona

source: Link down
it: Link in basso

source: Load Fails in Print
it: Errori Caricamento nella stampa

source: Load filament
it: Carica filamento

source: Load to Nozzle
it: Carica Ugello

source: Loadcell Value
it: Valore Cella di carico

source: LOADED FILAMENTS
it: FILAMENTI CARICATI

source: Loading Test
it: Test caricamento

source: Loading...
it: Caricamento...

source: Loaded
it: Caricato

source: Loaded filament
it: Filamento caricato

source: Loaded filaments
it: Filamenti caricati

source: MESSAGES
it: MESSAGGI

source: MMU Unit
it: Unità MMU

source: MMU filament
it: Filamento MMU

source: METRICS LIST
it: ELENCO MISURAZIONI

source: MK3 compatibility mode
it: Modalità compatibilità MK3

source: MORE
it: NO

source: MULTITOOL FILAMENT CHANGE
it: CAMBIO FILAMENTO MULTITOOL

source: Measuring X resonance...
it: Misuro la risonanza X...

source: Message History
it: Cronologia Messaggi

source: Metrics & Log
it: Metriche e Registro

source: Metrics Port
it: Porta Statistiche

source: Mismatching nozzle diameters
it: Diametri degli ugelli non corrispondenti

source: Manage Filaments
it: Gestione filamenti

source: Metrics List
it: Elenco Misurazioni

source: Move Axis
it: Sposta asse

source: Check the heatbed heater & thermistor wiring for possible damage.
it: Controllare eventuali danni sui cavi del piano riscaldato e del termistore.

source: Check the heatbed thermistor wiring for possible damage.
it: Controllare eventuali danni sul cavo del termistore del piano riscaldato.

source: Check the heatbreak thermistor wiring for possible damage.
it: Controlla che il cablaggio del termistore heatbreak non sia danneggiato.

source: Check the print head heater & thermistor wiring for possible damage.
it: Controllare eventuali danni sui cavi del hotend e del termistore.

source: Check the print head thermistor wiring for possible damage.
it: Controllare eventuali danni sul cavo del termistore del hotend.

source: Failed to home the extruder in X-axis, make sure there is no obstacle on X-axis.
it: Homing estrusore non riuscito sull'asse X. Assicurati che non ci siano ostacoli sull'asse X.

source: Failed to home the extruder in Y-axis, make sure there is no obstacle on Y-axis.
it: L'estrusore non è riuscito a posizionarsi sull'asse Y, assicurati che non ci siano ostacoli sull'asse Y.

source: Failed to home the extruder in Z-axis, make sure the loadcell is working.
it: Homing estrusore su asse Z non riuscito. Controlla il funzionamento della cella di carico.

source: Firmware Update Required
it: Aggiornamento del firmware richiesto

source: Firmware and hardware versions do not match. Make sure you have the right firmware file for your printer.
it: Le versioni del firmware e dell'hardware non corrispondono. Assicurati di avere il file del firmware giusto per la tua stampante.

source: HEATBED PORT OVERCURRENT
it: SOVRACORRENTE PORTA PIANO RISCALDATO

source: Heatbed connector no. %d: Nothing should be connected here.
it: Connettore del piano riscaldato no. %d: Qui non deve essere collegato nulla.

source: Heatbed tile no. %d: Unexpected temperature peak detected.
it: Piastrella del piano riscaldato no. %d: Rilevato un picco di temperatura inaspettato.

source: Heatbed tile no. %d: Preheat error.
it: Piastrella del piano riscaldato no. %d: Errore preheat.

source: Heatbed tile no. %d: Test heating error.
it: Piastrella del piano riscaldato no. %d: Errore nel test di riscaldamento.

source: Heatbed tile no. %d: Temperature measurement error; thermistor may be faulty.
it: Piastrella del piano riscaldato no. %d: Errore nella misurazione della temperatura; il termistore potrebbe essere guasto.

source: Heatbed tile no. %d: Unexpected temperature drop detected.
it: Piastrella del piano riscaldato no. %d: Rilevato un calo di temperatura inaspettato.

source: Hi, this is your Original Prusa MINI printer. I would like to guide you through the setup process.
it: Ciao, sono la tua stampante Original Prusa MINI. Ti guiderò nel processo di configurazione.

source: Insert the bundled USB drive, restart the printer and click the knob once during the boot. This will install the MK3.5 firmware.
it: Inserisci la chiavetta USB in dotazione, riavvia la stampante e clicca una volta sulla manopola durante l'avvio. In questo modo verrà installato il firmware MK3.5.

source: Insert the bundled USB drive, restart the printer and click the knob once during the boot. This will install the MK4/MK3.9 firmware.
it: Inserisci la chiavetta USB in dotazione, riavvia la stampante e clicca una volta sulla manopola durante l'avvio. In questo modo verrà installato il firmware MK4/MK3.9.

source: MCU in %s is overheated.
it: MCU in %s è surriscaldata.

source: Measured temperature is not matching expected value. Check the thermistor is in contact with heatbed. In case of damage, replace it.
it: La temperatura misurata non corrisponde al valore previsto. Controllare che il termistore sia a contatto con il piano riscaldato. In caso di danni, sostituirlo.

source: NOZZLE HEATER OVERCURRENT
it: SOVRACORRENTE RISCALDATORE UGELLO

source: Overcurrent detected on nozzle heater.
it: Rilevata sovracorrente sul riscaldatore dell'ugello.

source: PREHEAT ERROR
it: ERRORE PREHEAT

source: STEEL SHEEL NOT DETECTED
it: PIASTRA D'ACCIAIO NON RILEVATA

source: Steel sheet was not detected. Please put the sheet on to prevent printer damage.
it: Piastra d'acciaio non rilevata. Inserire la piastra per evitare danni alla stampante.

source: Axis check
it: Controllo Asse

source: Axis check was skipped
it: Il controllo dell'asse è stato saltato

source: Axis check was skipped because Loadcell check failed.
it: Il controllo dell'asse è stato saltato perché il controllo della cella di carico è fallito.

source: NOZZLE_OFFSET
it: OFFSET_UGELLO

source: New firmware available
it: Nuovo firmware disponibile

source: Newer FW req.: %s
it: Necessario FW più recente: %s

source: Nextruder Silicone Sock
it: Calzino in Silicone Nextruder

source: Newer firmware is required: %s
it: È necessario un firmware più recente: %s

source: Nozzle Diameter
it: Diametro ugello

source: Nozzle heater check
it: Contr. risc. Ugello

source: Nozzle Hardened
it: Ugello Temprato

source: Nozzle Preheat Temperature
it: Temperatura di preriscaldamento ugello

source: Nozzle Temp
it: Temp. Ugello

source: Nozzle diameter doesn't match
it: Il diametro dell'ugello non corrisponde

source: Nozzle is not hardened
it: L'ugello non è temprato

source: Nozzle is not high-flow
it: L'ugello non è ad alto flusso

source: Overcurrent detected on xBuddy heatbed port, disconnect the device.
it: Rilevata sovracorrente sulla porta del piano riscaldato della xBuddy, scollega il dispositivo.

source: PRINT
it: STAMPA

source: Please assign a tool to the filament
it: Assegna uno Strumento al filamento

source: Please wait
it: Attendere

source: Preheat
it: Riscalda

source: Preload All
it: Precarica Tutti

source: Preload to MMU
it: Precaricare su MMU

source: Preheating
it: Preriscaldamento

source: Print
it: Stampa

source: Print Statistics
it: Statistiche Stampa

source: Print finished
it: Stampa terminata

source: Printer tools
it: Strumenti stampante

source: Printer Setup
it: Setup Stampante

source: Printer doesn't have enough tools
it: La stampante non ha abbastanza strumenti

source: Printer model doesn't match
it: Il modello di stampante non corrisponde

source: Prusa Connect setup is not finished. Do you want to exit and abort the process?
it: L'installazione di Prusa Connect non è terminata. Vuoi uscire e interrompere il processo?

source: QUIT
it: ESCI

source: REHEAT
it: RISCALDA

source: REMOVE
it: RIMUOVI

source: REORDER FILAMENTS
it: RIORDINA FILAMENTI

source: Ready to print
it: Pronta per la stampa

source: Registering the printer to Prusa Connect...
it: Registrazione della stampante su Prusa Connect...

source: Remove the filament manually
it: Rimuovi il filamento manualmente

source: Error invalid selftest state
it: Errore stato autotest non valido

source: Ethernet cable not plugged in
it: Cavo ethernet non connesso

source: Ethernet connection
it: Connessione Ethernet

source: Fans check
it: Controllo Ventole

source: Filament sensor
it: Sensore filamento

source: Filament sensor check
it: Controllo sensore filamento

source: Reorder Filaments
it: Riordina filamenti

source: Heaters check
it: Controllo riscaldatori

source: Inactive
it: Inattivo

source: Restarting MMU
it: Riavvio MMU

source: Loadcell
it: Cella di carico

source: Loadcell Test
it: Test Cella di carico

source: Loadcell check
it: Controllo Cella di carico

source: Mon
it: Lu

source: Tool 5
it: Strumento 5

source: PRINT STATISTICS
it: STATISTICHE DI STAMPA

source: Run selftests and calibrations now?
it: Eseguire autotest e calibrazioni ora?

source: Test did not run
it: Test non eseguito

source: Test skipped by user.
it: Test saltato dall'utente.

source: CPU load
it: Carico CPU

source: SELFTEST
it: AUTOTEST

source: WiFi connection
it: Connessione WiFi

source: WiFi not connected
it: WiFi non connesso

source: Reset Z-length
it: Reset lunghezza Z

source: Reset steps per unit
it: Reset step per unità

source: SW Reset
it: Reset SW

source: Engaging idler
it: Innesto idler

source: Sat
it: Sa

source: Scan networks
it: Scansiona le reti

source: Scan the QR code using the Prusa app or camera, or visit prusa.io/add
it: Scansiona il codice QR utilizzando l'app Prusa o la fotocamera, oppure visita prusa.io/add

source: Scanning for networks...
it: Scansione reti...

source: %u %% / unknown
it: %u %% / sconosciuto

source: Accelerometer is not responding. Turn off the printer and make sure the accelerometer cable is connected to the main board. You can also abort the calibration and continue using the printer with previous settings.
it: L'accelerometro non risponde. Spegni la stampante e assicurati che il cavo dell'accelerometro sia collegato alla scheda principale. Puoi anche interrompere la calibrazione e continuare a usare la stampante con le impostazioni precedenti.

source: Scanning...
it: Scansione...

source: Set up Prusa Connect?
it: Configurare Prusa Connect?

source: Settings
it: Impost.

source: Avoiding grind
it: Evito triturazione

source: All tests passed successfully.
it: Tutti i test sono stati superati correttamente.

source: Are the belts vibrating?
it: Le cinghie vibrano?

source: Board Temperature
it: Temperatura scheda

source: CANCEL
it: ANNULLA

source: CHANGE
it: CAMBIA

source: CALIBRATE
it: CALIBRA

source: CONTINUE
it: CONTINUA

source: Attention, the test has failed. This could have been caused by a wrong configuration. Do you want to revise your printer configuration?
it: Attenzione, il test è fallito. Il problema potrebbe essere causato da una configurazione errata. Vuoi modificare la configurazione della stampante?

source: Show All
it: Mostra tutto

source: Skip network setup
it: Salta la configurazione della rete

source: Stopping MMU
it: Arresto della MMU

source: Strict
it: Esatto

source: Sun
it: Do

source: System Info
it: Info di sistema

source: Calibration failed to find corrections to motor current.
it: La calibrazione non è riuscita a trovare le correzioni alla corrente del motore.

source: The Wi-Fi module is not working properly or is missing. Insert the module, try restarting the printer, or use the ethernet cable.
it: Il modulo Wi-Fi non funziona correttamente o è mancante. Inserisci il modulo, prova a riavviare la stampante o utilizza il cavo Ethernet.

source: The file disappeared
it: Il file è scomparso

source: The file is not a valid bgcode file.
it: Il file non è un file bgcode valido.

source: Change Wave Table XYZ
it: Cambia Tabella Onde XYZ

source: Do you wish to retry the failed selftest?
it: Vuoi riprovare l'autotest fallito?

source: Check that the accelerometer cable is plugged in and not damaged.
it: Verificare che il cavo dell'accelerometro sia collegato e non sia danneggiato.

source: The path does not exist
it: Il percorso non esiste

source: There are printing tools with no filament loaded, this could ruin the print. Disable filament sensor and print anyway?
it: Ci sono strumenti di stampa senza filamento caricato, questo potrebbe rovinare la stampa. Disattivare il sensore di filamento e stampare comunque?

source: There might be a slight resistance. If the filament is stuck, open the idler lever.
it: Devi avvertire una leggera resistenza. Se il filamento è bloccato, apri la leva dell'idler.

source: Caution! Disabling the door sensor may lead to injury or printer damage. Proceeding means you accept full responsibility. We are not liable for any harm or damages.
it: Attenzione! La disattivazione del sensore dello sportello può causare lesioni o danni alla stampante. Procedendo, l'utente si assume la piena responsabilità. Non siamo responsabili per eventuali danni o lesioni.

source: Chamber
it: Camera

source: Chamber Fan 1
it: Ventola Camera 1

source: Chamber temperature
it: Temperatura della camera

source: Connect
it: Connesso

source: Hi, this is your Original Prusa printer. I would like to guide you through the setup process.
it: Ciao, questa è la tua stampante Original Prusa. Vorrei guidarti attraverso il processo di configurazione.

source: Connecting
it: Connessione

source: Continue running Calibrations & Tests?
it: Continuare con le Calibrazioni e test?

source: Cooling down. Do not touch the nozzle!
it: Raffreddamento. Non toccare l'ugello!

source: Network Status
it: Stato Rete

source: Ping | Loss
it: Ping | Perdita

source: Printer Model
it: Modello stampante

source: Cutter
it: Taglierino

source: Cutting filament
it: Taglio filamento

source: Sheet name
it: Nome piastra

source: Sheet:
it: Piastra:

source: DISABLE MMU
it: DISABILITA MMU

source: DNS error
it: errore DNS

source: DONE
it: FATTO

source: DOWN
it: GIÙ

source: Validity check
it: Controllo di validità

source: This filament already has a tool assigned. Do you want to REPLACE the assigned tool with the selected tool or add the selected tool for the SPOOL JOIN functionality?
it: A questo filamento è già stato assegnato uno Strumento. Vuoi sostituire lo strumento assegnato con lo strumento selezionato o aggiungere lo strumento selezionato per la funzionalità SPOOL JOIN?

source: This tool is already assigned to this filament.
it: Questo strumento è già assegnato a questo filamento.

source: This tool is already spool joined to this filament. Do you want to REPLACE it as first or REMOVE it from spool join?
it: Strumento già in spool join con questo filamento. Vuoi prima SOSTITUIRLO o RIMUOVERLO dallo spool join?
